{
  "title": "The Final Empire",
  "author": "Brandon Sanderson",
  "totalChapters": 38,
  "chapters": [
    {
      "number": 1,
      "title": "The Survivor of Hathsin",
      "summary": "A thieving crew watches the nobility and plans a heist in the ash-covered city of Luthadel.",
      "charactersIntroduced": ["Kelsier", "Dockson"],
      "characters": {
        "Kelsier": {
          "background": "A legendary thief known as the Survivor of Hathsin, the only person to escape the Lord Ruler's most brutal prison.",
          "arc": "Returns to Luthadel with a grand plan to overthrow the immortal emperor who has ruled for a thousand years."
        },
        "Dockson": {
          "background": "Kelsier's longtime friend and the crew's organizer, skilled at managing the practical details of their operations.",
          "arc": "Reunites with Kelsier and begins planning what seems to be their most ambitious job yet."
        }
      }
    },
    {
      "number": 2,
      "title": "A Proposal",
      "summary": "Vin survives on the streets using her Luck while her thieving crew plans their next scheme.",
      "charactersIntroduced": ["Vin", "Camon", "Theron"],
      "characters": {
        "Vin": {
          "background": "A 16-year-old street thief with an unusual ability she calls 'Luck' that helps her influence people.",
          "arc": "Struggles to survive in her abusive thieving crew while hiding the full extent of her mysterious abilities."
        },
        "Camon": {
          "background": "The cruel leader of Vin's thieving crew who regularly beats his members and takes unnecessary risks.",
          "arc": "Plans a dangerous scam against an obligator, showing his greed and disregard for his crew's safety."
        },
        "Theron": {
          "background": "Camon's second-in-command who treats the crew members slightly better than Camon does.",
          "arc": "Helps plan the crew's scam while showing subtle signs of dissatisfaction with Camon's leadership."
        },
        "Kelsier": {
          "background": "A legendary thief known as the Survivor of Hathsin, the only person to escape the Lord Ruler's most brutal prison.",
          "arc": "Continues recruiting for his master plan, showing interest in crews with unusual members."
        },
        "Dockson": {
          "background": "Kelsier's longtime friend and the crew's organizer, skilled at managing the practical details of their operations.",
          "arc": "Assists Kelsier in evaluating potential recruits for their unprecedented heist."
        }
      }
    },
    {
      "number": 3,
      "title": "Rebels",
      "summary": "Kelsier saves Vin from her crew and reveals the truth about her abilities as Allomancy.",
      "charactersIntroduced": [],
      "characters": {
        "K
