{
  "title": "The Final Empire",
  "author": "Brandon Sanderson",
  "totalChapters": 38,
  "chapters": [
    {
      "number": 1,
      "title": "The Survivor of Hathsin",
      "summary": "A thieving crew watches the nobility and plans a heist in the ash-covered city of Luthadel.",
      "charactersIntroduced": ["Kelsier", "Dockson"],
      "characters": {
        "Kelsier": {
          "background": "A legendary thief known as the Survivor of Hathsin, the only person to escape the Lord Ruler's most brutal prison.",
          "arc": "Returns to Luthadel with a grand plan to overthrow the immortal emperor who has ruled for a thousand years."
        },
        "Dockson": {
          "background": "Kelsier's longtime friend and the crew's organizer, skilled at managing the practical details of their operations.",
          "arc": "Reunites with Kelsier and begins planning what seems to be their most ambitious job yet."
        }
      }
    },
    {
      "number": 2,
      "title": "A Proposal",
      "summary": "Vin survives on the streets using her Luck while her thieving crew plans their next scheme.",
      "charactersIntroduced": ["Vin", "Camon", "Theron"],
      "characters": {
        "Vin": {
          "background": "A 16-year-old street thief with an unusual ability she calls 'Luck' that helps her influence people.",
          "arc": "Struggles to survive in her abusive thieving crew while hiding the full extent of her mysterious abilities."
        },
        "Camon": {
          "background": "The cruel leader of Vin's thieving crew who regularly beats his members and takes unnecessary risks.",
          "arc": "Plans a dangerous scam against an obligator, showing his greed and disregard for his crew's safety."
        },
        "Theron": {
          "background": "Camon's second-in-command who treats the crew members slightly better than Camon does.",
          "arc": "Helps plan the crew's scam while showing subtle signs of dissatisfaction with Camon's leadership."
        },
        "Kelsier": {
          "background": "A legendary thief known as the Survivor of Hathsin, the only person to escape the Lord Ruler's most brutal prison.",
          "arc": "Continues recruiting for his master plan, showing interest in crews with unusual members."
        },
        "Dockson": {
          "background": "Kelsier's longtime friend and the crew's organizer, skilled at managing the practical details of their operations.",
          "arc": "Assists Kelsier in evaluating potential recruits for their unprecedented heist."
        }
      }
    },
    {
      "number": 3,
      "title": "The Eleventh Metal",
      "summary": "Kelsier saves Vin from her crew and reveals the truth about her abilities as Allomancy.",
      "charactersIntroduced": [],
      "characters": {
        "Kelsier": {
          "background": "A legendary thief known as the Survivor of Hathsin, the only person to escape the Lord Ruler's most brutal prison.",
          "arc": "Reveals himself as a Mistborn and saves Vin from the obligators, recognizing her as one of his kind."
        },
        "Vin": {
          "background": "A 16-year-old street thief who just discovered her 'Luck' is actually a rare magical ability called Allomancy.",
          "arc": "Learns she is a Mistborn with the ability to ingest and burn metals for magical powers, opening up an entirely new world."
        },
        "Dockson": {
          "background": "Kelsier's longtime friend and the crew's organizer, skilled at managing the practical details of their operations.",
          "arc": "Helps explain the basics of their operation to Vin and shows his role as the practical planner of the group."
        }
      }
    },
    {
      "number": 4,
      "title": "Training",
      "summary": "Vin begins her Allomantic training and meets the rest of Kelsier's thieving crew.",
      "charactersIntroduced": ["Breeze", "Ham", "Clubs", "Spook", "Sazed"],
      "characters": {
        "Vin": {
          "background": "A 16-year-old Mistborn discovering her abilities to ingest and burn metals for magical powers.",
          "arc": "Begins intensive Allomantic training while struggling to trust her new crew after years of abuse and betrayal."
        },
        "Kelsier": {
          "background": "A legendary thief and Mistborn who escaped the Lord Ruler's most brutal prison.",
          "arc": "Takes on the role of Vin's mentor, teaching her Allomancy while revealing glimpses of his larger plan."
        },
        "Breeze": {
          "background": "A Soother who can manipulate emotions using Allomancy, with a taste for fine wine and comfortable living.",
          "arc": "Joins Kelsier's crew as their emotional manipulator, showing both his skills and his pompous personality."
        },
        "Ham": {
          "background": "A Thug who can burn pewter for enhanced strength and endurance, known for his philosophical debates.",
          "arc": "Serves as the crew's muscle while constantly engaging others in theoretical discussions about morality and society."
        },
        "Clubs": {
          "background": "A Smoker who can hide Allomantic activity, running a carpentry shop as a front for the crew's operations.",
          "arc": "Provides a safe house for the crew while maintaining his gruff, pessimistic demeanor."
        },
        "Spook": {
          "background": "Clubs's nephew, a Tineye who can enhance his senses by burning tin, speaking in Eastern street slang.",
          "arc": "Acts as the crew's scout and spy while trying to prove himself to the more experienced members."
        },
        "Sazed": {
          "background": "A Terris Keeper who stores knowledge in metalminds and serves as a steward despite his people's oppression.",
          "arc": "Agrees to help train Vin in court etiquette while sharing his vast knowledge of religions and history."
        },
        "Dockson": {
          "background": "Kelsier's longtime friend and the crew's organizer, the only non-Allomancer in the core group.",
          "arc": "Manages the crew's finances and logistics while showing fatherly concern for Vin's well-being."
        }
      }
    }
  ]
}
