{
  "title": "Mistborn",
  "books": {
    "final-empire": {
      "title": "The Final Empire",
      "chapters": 38,
      "characters": {
        "vin": {
          "name": "Vin",
          "appearsInChapters": [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "1": "A young thief from the streets of Luthadel who has lived a harsh life under her brother's crew. She discovers she has magical abilities and is recruited by a mysterious nobleman named Kelsier.",
            "5": "A young thief who has joined Kelsier's thieving crew and is learning about her Allomantic powers. She struggles with trusting others and finding her place among the crew.",
            "10": "A street thief turned noblewoman who is learning to navigate high society while training her Allomantic abilities. She poses as Valette Renoux to infiltrate noble society.",
            "15": "An Allomancer posing as noblewoman Valette Renoux who has grown more confident in her powers and social skills. She finds herself torn between her growing feelings for Elend and her loyalty to the crew.",
            "25": "A powerful Mistborn who has fully embraced her abilities and her role in Kelsier's plan to overthrow the Final Empire. She struggles with the violence required and her deepening relationship with Elend.",
            "35": "A skilled Mistborn who has become central to the rebellion against the Lord Ruler. She faces the ultimate test of her powers and must make difficult choices about her future and the fate of the empire."
          }
        },
        "kelsier": {
          "name": "Kelsier",
          "appearsInChapters": [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30],
          "descriptions": {
            "1": "A legendary thief and Mistborn known as the 'Survivor of Hathsin' who escaped the Lord Ruler's prison camps. He recruits Vin and plans an impossible heist to overthrow the immortal emperor.",
            "10": "The charismatic leader of a thieving crew who is training Vin in Allomancy while planning to steal the Lord Ruler's treasury. He carries deep hatred for the nobility and the Final Empire.",
            "20": "A powerful Mistborn leading a complex plan to destabilize the Final Empire through both theft and rebellion. He becomes increasingly radical in his methods and beliefs about overthrowing the social order.",
            "30": "The legendary Survivor whose plan to overthrow the Lord Ruler reaches its climax. His actions set in motion events that will forever change the Final Empire and leave a lasting impact on all who knew him."
          }
        },
        "elend": {
          "name": "Elend Venture",
          "appearsInChapters": [6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "6": "A young nobleman and heir to House Venture who is idealistic and dreams of political reform. He's often found reading philosophy books at noble parties instead of socializing.",
            "15": "An idealistic nobleman who has grown close to Valette Renoux (Vin) and shares his dreams of creating a better government. He remains unaware of her true identity as a thief and Mistborn.",
            "25": "A nobleman torn between his growing love for Valette and his duty to his house during the growing chaos in Luthadel. He continues to advocate for political reform despite the dangerous times.",
            "35": "A young nobleman who discovers Valette's true identity as Vin and must reconcile his feelings with the reality of her role in the rebellion. He faces the collapse of his world and the challenge of his idealistic beliefs."
          }
        },
        "dockson": {
          "name": "Dockson",
          "appearsInChapters": [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "2": "Kelsier's best friend and the crew's organizer who handles logistics and planning for their operations. He is a skilled non-Allomancer who shares Kelsier's hatred of the nobility.",
            "10": "The crew's practical organizer who manages the rebellion's logistics while maintaining his deep loyalty to Kelsier. He serves as a steady voice of reason among the more volatile crew members.",
            "20": "A trusted lieutenant in the rebellion who coordinates between different skaa factions and manages resources. His organizational skills prove crucial to the growing revolution against the Final Empire.",
            "35": "Kelsier's devoted friend who continues to support the crew's mission even after learning the full scope of their dangerous plan. He remains committed to seeing the rebellion through to its conclusion."
          }
        },
        "ham": {
          "name": "Hammond (Ham)",
          "appearsInChapters": [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "2": "A Pewterarm (Thug) in Kelsier's crew who possesses enhanced physical strength and endurance through Allomancy. He enjoys philosophical discussions and questioning the ethics of their actions.",
            "10": "A thoughtful warrior who serves as the crew's muscle while often engaging in philosophical debates about their methods. He struggles with the moral implications of their increasingly violent rebellion.",
            "20": "The rebellion's general who trains and leads the skaa army while continuing to question the ethics of their war. His combination of physical prowess and intellectual curiosity makes him a unique military leader.",
            "35": "A veteran commander who has guided the rebel army through numerous battles and proven his tactical abilities. He remains the crew's conscience, always questioning whether their violent methods are justified."
          }
        },
        "breeze": {
          "name": "Breeze",
          "appearsInChapters": [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "2": "A Soother who can dampen emotions through Allomancy, known for his refined tastes and love of fine wine. He affects a nobleman's mannerisms despite his thieving background.",
            "10": "An elegant Soother who uses his Allomantic abilities to manipulate emotions during the crew's infiltration of noble society. His refined appearance and manners make him perfect for high-society operations.",
            "20": "A skilled emotional manipulator who helps coordinate the rebellion by influencing key figures throughout Luthadel. His Soothing abilities prove invaluable for managing both allies and enemies.",
            "35": "A master of emotional manipulation whose Allomantic skills have been crucial to the rebellion's success. Despite his dandified exterior, he has proven his loyalty and courage when it matters most."
          }
        },
        "clubs": {
          "name": "Clubs",
          "appearsInChapters": [3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "3": "A gruff Smoker who can create copperlouds to hide Allomantic activity, working as a carpenter while secretly protecting skaa Allomancers. He is Spook's uncle and known for his pessimistic outlook.",
            "10": "The crew's Smoker who provides crucial protection from Inquisitors while maintaining his carpenter's workshop as their base. His cynical attitude masks a deep care for the crew's safety.",
            "20": "A reliable Smoker whose coppercloud abilities are essential for hiding the rebellion's Allomantic activities from the Steel Inquisitors. His workshop serves as a safe haven for planning operations.",
            "35": "A veteran Smoker who has kept the crew safe from Inquisitor detection throughout their dangerous mission. His gruff exterior hides his genuine affection for his makeshift family of thieves."
          }
        },
        "spook": {
          "name": "Spook (Lestibournes)",
          "appearsInChapters": [3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "3": "A young Tineye with enhanced senses who speaks in confusing Eastern street slang and idolizes Kelsier. He is Clubs' nephew and the youngest member of the thieving crew.",
            "10": "An enthusiastic scout whose Tineye abilities make him invaluable for reconnaissance and surveillance. His strange dialect and hero-worship of Kelsier often amuse and confuse the other crew members.",
            "20": "A dedicated spy whose enhanced senses allow him to gather crucial intelligence for the rebellion. His unwavering loyalty to Kelsier and the crew drives him to take increasingly dangerous risks.",
            "35": "A young Tineye who has proven his worth as a scout and spy throughout the rebellion. His devotion to Kelsier's ideals and his unique way of speaking have made him a beloved member of the crew."
          }
        },
        "marsh": {
          "name": "Marsh",
          "appearsInChapters": [4,5,6,7,8,9,10,11,12
