{
  "__comment": "This file contains spoiler-free data for Mistborn4.",
  "book": {
    "title": "Mistborn: The Alloy of Law",
    "totalChapters": 28,
    "affiliateLink": "https://www.amazon.com/dp/0765378574?tag=profitfirstre-20"
  },
  "characters": [
    {
      "name": "Waxillium Ladrian",
      "firstAppearance": 1,
      "featuredIn": [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Waxillium Ladrian, a seasoned lawman from the Roughs, has reluctantly returned to Elendel to assume his role as a nobleman."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Waxillium Ladrian, still the ex-lawman turned nobleman, struggles to balance city life with his instinct for justice."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Waxillium Ladrian, the Roughs lawman now navigating noble society, finds his dual identity pulled into growing conflicts."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Waxillium Ladrian, ever the lawman at heart despite his noble title, stands at the center of events that could reshape Elendel."
        }
      ]
    },
    {
      "name": "Wayne",
      "firstAppearance": 3,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Wayne, Wax’s irreverent partner from the Roughs, is a quick-witted charmer with a talent for disguise."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Wayne, the irreverent Roughs partner, brings humor and unorthodox methods to Wax’s return to city life."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Wayne, still the mischievous sidekick, shows hidden depths beneath his banter and tricks."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Wayne, the loyal partner and master of mischief, proves that behind the jokes lies unwavering friendship."
        }
      ]
    },
    {
      "name": "Marasi Colms",
      "firstAppearance": 8,
      "featuredIn": [
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Marasi Colms, a bright young law student, admires Wax’s Roughs legend and seeks her own place in the world."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Marasi, the ambitious student, becomes more entangled in Wax’s investigations and the city’s troubles."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Marasi, still the eager student, shows courage and intelligence as the stakes climb higher."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Marasi Colms, the determined law student, steps into her own and helps change the game."
        }
      ]
    },
    {
      "name": "Steris Harms",
      "firstAppearance": 4,
      "featuredIn": [
        4,
        5,
        11,
        16,
        21,
        25,
        28
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Steris Harms, Wax’s reserved fiancée, is precise and proper in all things."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Steris, still the meticulous fiancée, begins showing layers beneath her careful planning."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Steris Harms, the ever‑prepared noblewoman, reveals unexpected resilience."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Steris, Wax’s steadfast partner, remains measured even as chaos unfolds."
        }
      ]
    },
    {
      "name": "Ranette",
      "firstAppearance": 13,
      "featuredIn": [
        13,
        14,
        17
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Ranette, a skilled weaponsmith and old acquaintance of Wayne, prefers her work to company."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Ranette, the solitary weaponsmith, aids Wax and Wayne with her inventive tools."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Ranette, still the sharp‑tongued weaponsmith, proves invaluable through her craft."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Ranette, the fiercely independent weaponsmith, leaves her mark on the fight."
        }
      ]
    },
    {
      "name": "Lord Harms",
      "firstAppearance": 4,
      "featuredIn": [
        4,
        5,
        11,
        16
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Lord Harms, father of Steris and Marasi, is a nobleman concerned with propriety and alliances."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Lord Harms, the cautious father, keeps a watchful eye on Wax and his daughters."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Lord Harms, still the protective nobleman, tries to balance family and politics."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Lord Harms, the head of his household, stands firm through upheaval."
        }
      ]
    },
    {
      "name": "Claude Aradel",
      "firstAppearance": 6,
      "featuredIn": [
        6,
        7,
        10,
        12,
        15,
        20,
        22
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Claude Aradel, Elendel’s constable-general, is a pragmatic man tasked with maintaining order."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Aradel, the pragmatic constable-general, finds Wax’s involvement both helpful and disruptive."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Aradel, still the steady constable-general, adapts to the growing turmoil."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Claude Aradel, the level-headed lawman, becomes a key figure in the city’s defense."
        }
      ]
    },
    {
      "name": "Captain Brettin",
      "firstAppearance": 6,
      "featuredIn": [
        6,
        7,
        10,
        12
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Captain Brettin, a city constable, serves dutifully under Aradel’s command."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Brettin, the diligent captain, follows orders but wrestles with Wax’s unorthodox ways."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Brettin, still the dutiful captain, works to keep the peace as danger escalates."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Captain Brettin, the steadfast constable, holds the line when law is tested."
        }
      ]
    },
    {
      "name": "Tillaume",
      "firstAppearance": 1,
      "featuredIn": [
        1,
        2,
        4,
        5,
        11
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Tillaume, Wax’s butler, is discreet and efficient in service to the Ladrian household."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Tillaume, the ever‑efficient butler, keeps the household running while Wax pursues other matters."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Tillaume, still the discreet butler, reveals more about his quiet loyalty."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Tillaume, Wax’s trusted butler, remains steady even when the house faces upheaval."
        }
      ]
    },
    {
      "name": "Miles Dagouter",
      "firstAppearance": 7,
      "featuredIn": [
        7,
        8,
        10,
        14,
        17,
        18,
        19,
        20,
        21,
        22,
        24,
        25,
        26,
        27,
        28
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Miles Dagouter, a former lawman turned outlaw, now leads a dangerous path in Elendel."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Miles, the disillusioned former lawman, orchestrates crimes with unnerving confidence."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Miles Dagouter, still the hardened outlaw, shows the full extent of his determination."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Miles, the relentless leader, stands as Wax’s most formidable foe."
        }
      ]
    },
    {
      "name": "Suit",
      "firstAppearance": 9,
      "featuredIn": [
        9,
        14,
        18,
        20,
        25,
        28
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Suit, Wax’s uncle Edwarn Ladrian, is a polished nobleman with hidden motives."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Suit, the calculating uncle, maneuvers quietly within the city’s politics."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Suit, still the urbane manipulator, extends his influence behind the scenes."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Suit, the ruthless nobleman, reveals the depths of his schemes."
        }
      ]
    },
    {
      "name": "Mr. Ironeyes",
      "firstAppearance": 28,
      "featuredIn": [
        28
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Mr. Ironeyes is a mysterious, frightening figure whispered about in the city."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Mr. Ironeyes, the unsettling legend, appears briefly to remind all of old powers."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Mr. Ironeyes, still enigmatic, leaves only questions in his wake."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Mr. Ironeyes, the chilling figure of myth, remains a shadow in the story."
        }
      ]
    },
    {
      "name": "The Vanishers",
      "firstAppearance": 5,
      "featuredIn": [
        5,
        6,
        7,
        8,
        10,
        14,
        17,
        18,
        19,
        20,
        21,
        22,
        24,
        25,
        26,
        27
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "The Vanishers are a band of masked criminals striking fear with bold robberies."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "The Vanishers, the elusive gang, grow more daring and violent."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "The Vanishers, still masked and ruthless, show a sinister purpose behind the thefts."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "The Vanishers, the relentless outlaws, press their attacks to the end."
        }
      ]
    },
    {
      "name": "Marksman",
      "firstAppearance": 10,
      "featuredIn": [
        10,
        14,
        17,
        18,
        19,
        20,
        21,
        22,
        24,
        25,
        26,
        27
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Marksman is Miles’s sharp-eyed lieutenant, dangerous with a rifle."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Marksman, the cold lieutenant, aids Miles with precision and skill."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Marksman, still Miles’s trusted marksman, stays lethal and loyal."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Marksman, the deadly second‑in‑command, fights to the bitter end."
        }
      ]
    },
    {
      "name": "Tarson",
      "firstAppearance": 10,
      "featuredIn": [
        10,
        17,
        18,
        20,
        21,
        24,
        25,
        26,
        27
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Tarson is a brutish thug working for the Vanishers."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Tarson, the brutal thug, proves his loyalty through violence."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Tarson, still the muscle, becomes an even more dangerous enforcer."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Tarson, the Vanishers’ brute, shows his savagery in full."
        }
      ]
    },
    {
      "name": "Jaksin Harms",
      "firstAppearance": 4,
      "featuredIn": [
        4,
        5,
        11,
        16,
        21,
        25
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Jaksin Harms, Marasi’s brother, is a minor noble with few concerns beyond himself."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Jaksin, the self‑interested brother, remains aloof from the city’s danger."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Jaksin Harms, still the detached nobleman, drifts at the story’s edges."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Jaksin, the idle brother, continues to avoid the storm around him."
        }
      ]
    },
    {
      "name": "Lady Patresen",
      "firstAppearance": 4,
      "featuredIn": [
        4,
        11
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Lady Patresen is a socialite seen at gatherings in Elendel."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Lady Patresen, the curious socialite, gossips on the fringes of the tale."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Lady Patresen, still the socialite, flits through events with little change."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Lady Patresen, the idle socialite, remains a passing presence."
        }
      ]
    },
    {
      "name": "Lord Tekiel",
      "firstAppearance": 4,
      "featuredIn": [
        4,
        11
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Lord Tekiel is a minor noble name in Elendel society."
        },
        {
          "startChapter": 6,
          "endChapter": 12,
          "text": "Lord Tekiel, the minor noble, is mentioned in passing as politics swirl."
        },
        {
          "startChapter": 13,
          "endChapter": 20,
          "text": "Lord Tekiel, still a minor figure, lingers at the edges of events."
        },
        {
          "startChapter": 21,
          "endChapter": 28,
          "text": "Lord Tekiel, the minor noble, remains a background name in the city’s drama."
        }
      ]
    }
  ],
  "recaps": {
    "Prologue": "Waxillium Ladrian, a Roughs lawman, hunts a dangerous criminal, showing the grit of frontier justice.",
    "1": "Wax returns to Elendel after years away, confronting the life of a noble he left behind.",
    "2": "Wax struggles with noble duties and old instincts as rumors of strange crimes surface.",
    "3": "Wayne’s arrival brings levity and reminders of the life Wax thought he’d left.",
    "4": "Wax finds his new life complicated by a betrothal arrangement and unresolved feelings.",
    "5": "A shocking robbery interrupts Wax’s attempt to settle into noble society.",
    "6": "Wax digs into the investigation, finding clues pointing to a dangerous new gang.",
    "7": "The Vanishers strike again, pushing Wax closer to his lawman instincts.",
    "8": "Marasi steps into the picture, eager to help Wax understand the case.",
    "9": "Wax, Wayne, and Marasi start piecing together the gang’s movements.",
    "10": "Tension rises as the Vanishers’ targets grow bolder.",
    "11": "Wax confronts nobles for information, drawing resistance.",
    "12": "Wayne’s antics lead to insights, and Wax begins to see a larger pattern.",
    "13": "Ranette arms the team, adding deadly tools to their pursuit.",
    "14": "Wax’s investigation turns personal as the stakes escalate.",
    "15": "The Vanishers’ crimes intensify, spreading fear in Elendel.",
    "16": "Wax struggles to balance his lawman instincts and noble obligations.",
    "17": "An ambush reveals the Vanishers are more organized than imagined.",
    "18": "Marasi’s resourcefulness helps the group find their next lead.",
    "19": "Wax and Wayne close in on Miles’s network.",
    "20": "The conflict between Wax and Miles becomes inevitable.",
    "21": "Miles’s plot deepens, and Wax pushes toward a final confrontation.",
    "22": "The Vanishers’ plans start to unravel under Wax’s pursuit.",
    "23": "A daring rescue brings revelations and danger.",
    "24": "Loyalties are tested as Wax and his allies press forward.",
    "25": "The investigation collides with Wax’s family ties.",
    "26": "Miles and his lieutenants make their last, boldest moves.",
    "27": "Wax and Wayne face a deadly showdown.",
    "28": "The dust settles as the truth behind the crimes is fully revealed.",
    "29": "New questions emerge as Wax reflects on what the future may hold."
  }
}