{
  "book": {
    "title": "Mistborn: The Final Empire",
    "totalChapters": 38
  },
  "characters": [
    {
      "name": "Vin",
      "firstAppearance": 1,
      "description": "A wary street urchin who discovers she’s a Mistborn; cautious, observant, and learning to trust."
    },
    {
      "name": "Kelsier",
      "firstAppearance": 1,
      "description": "A charismatic Mistborn rebel leader known as “The Survivor,” aiming to overthrow the Lord Ruler."
    },
    {
      "name": "Lord Ruler",
      "firstAppearance": 1,
      "description": "The immortal, god‑like tyrant ruling the Final Empire for a thousand years."
    },
    {
      "name": "Dockson",
      "firstAppearance": 3,
      "description": "Kelsier’s calm, organized right‑hand man who handles logistics—but isn’t an Allomancer."
    },
    {
      "name": "Ham (Hammond)",
      "firstAppearance": 3,
      "description": "A strong Pewter‑arm Thug; grounded, thoughtful, and protective of the crew."
    },
    {
      "name": "Breeze",
      "firstAppearance": 3,
      "description": "A smooth‑talking Soother who manipulates moods; strategic and often lighthearted."
    },
    {
      "name": "Clubs",
      "firstAppearance": 3,
      "description": "A copper‑burning Smoker and ex‑army carpenter; practical, blunt, dependable."
    },
    {
      "name": "Spook (Lestibournes)",
      "firstAppearance": 3,
      "description": "The youngest crew member; a Tin‑burning Tineye with heightened senses and street slang."
    },
    {
      "name": "Sazed",
      "firstAppearance": 5,
      "description": "A gentle Terrisman Keeper and Feruchemist preserving lore and multiple religions."
    },
    {
      "name": "Elend Venture",
      "firstAppearance": 6,
      "description": "An idealistic nobleman of House Venture; scholarly, reform-minded, intrigued by Vin."
    },
    {
      "name": "Yeden",
      "firstAppearance": 8,
      "description": "A skaa rebel leader seeking alliances; principled, cautious, wary of betrayal."
    },
    {
      "name": "Marsh",
      "firstAppearance": 10,
      "description": "Kelsier’s brother; once allied with him, now silent and intense with an uncertain role."
    },
    {
      "name": "Marsh (Steel Inquisitor)",
      "firstAppearance": 25,
      "description": "Marsh has transformed into a Steel Inquisitor—powerful, emotionless, and terrifying."
    },
    {
      "name": "Lord Renoux (Imposter / Kandra)",
      "firstAppearance": 12,
      "description": "A noble ally of the crew—polite and helpful, though not quite what he seems."
    },
    {
      "name": "Straff Venture",
      "firstAppearance": 15,
      "description": "Elend’s father and head of House Venture; imposing, proud, politically powerful."
    },
    {
      "name": "Shan Elariel",
      "firstAppearance": 15,
      "description": "A Mistborn and Elend’s fiancée at the start—proper, poised, with a hidden strength."
    },
    {
      "name": "Allrianne Cett",
      "firstAppearance": 18,
      "description": "Daughter of Lord Ashweather Cett; playful, fashionable, and romantically linked to Breeze."
    },
    {
      "name": "OreSeur (Kandra)",
      "firstAppearance": 20,
      "description": "A kandra bound to Lord Renoux and later to Vin; quiet, observant, and capable of mimicry."
    }
  ],
  "recaps": {
    "1": "This is a spoiler-free summary for Chapter 1 of Mistborn: The Final Empire.",
    "2": "This is a spoiler-free summary for Chapter 2 of Mistborn: The Final Empire.",
    "3": "This is a spoiler-free summary for Chapter 3 of Mistborn: The Final Empire.",
    "4": "This is a spoiler-free summary for Chapter 4 of Mistborn: The Final Empire.",
    "5": "This is a spoiler-free summary for Chapter 5 of Mistborn: The Final Empire.",
    "6": "This is a spoiler-free summary for Chapter 6 of Mistborn: The Final Empire.",
    "7": "This is a spoiler-free summary for Chapter 7 of Mistborn: The Final Empire.",
    "8": "This is a spoiler-free summary for Chapter 8 of Mistborn: The Final Empire.",
    "9": "This is a spoiler-free summary for Chapter 9 of Mistborn: The Final Empire.",
    "10": "This is a spoiler-free summary for Chapter 10 of Mistborn: The Final Empire.",
    "11": "This is a spoiler-free summary for Chapter 11 of Mistborn: The Final Empire.",
    "12": "This is a spoiler-free summary for Chapter 12 of Mistborn: The Final Empire.",
    "13": "This is a spoiler-free summary for Chapter 13 of Mistborn: The Final Empire.",
    "14": "This is a spoiler-free summary for Chapter 14 of Mistborn: The Final Empire.",
    "15": "This is a spoiler-free summary for Chapter 15 of Mistborn: The Final Empire.",
    "16": "This is a spoiler-free summary for Chapter 16 of Mistborn: The Final Empire.",
    "17": "This is a spoiler-free summary for Chapter 17 of Mistborn: The Final Empire.",
    "18": "This is a spoiler-free summary for Chapter 18 of Mistborn: The Final Empire.",
    "19": "This is a spoiler-free summary for Chapter 19 of Mistborn: The Final Empire.",
    "20": "This is a spoiler-free summary for Chapter 20 of Mistborn: The Final Empire.",
    "21": "This is a spoiler-free summary for Chapter 21 of Mistborn: The Final Empire.",
    "22": "This is a spoiler-free summary for Chapter 22 of Mistborn: The Final Empire.",
    "23": "This is a spoiler-free summary for Chapter 23 of Mistborn: The Final Empire.",
    "24": "This is a spoiler-free summary for Chapter 24 of Mistborn: The Final Empire.",
    "25": "This is a spoiler-free summary for Chapter 25 of Mistborn: The Final Empire.",
    "26": "This is a spoiler-free summary for Chapter 26 of Mistborn: The Final Empire.",
    "27": "This is a spoiler-free summary for Chapter 27 of Mistborn: The Final Empire.",
    "28": "This is a spoiler-free summary for Chapter 28 of Mistborn: The Final Empire.",
    "29": "This is a spoiler-free summary for Chapter 29 of Mistborn: The Final Empire.",
    "30": "This is a spoiler-free summary for Chapter 30 of Mistborn: The Final Empire.",
    "31": "This is a spoiler-free summary for Chapter 31 of Mistborn: The Final Empire.",
    "32": "This is a spoiler-free summary for Chapter 32 of Mistborn: The Final Empire.",
    "33": "This is a spoiler-free summary for Chapter 33 of Mistborn: The Final Empire.",
    "34": "This is a spoiler-free summary for Chapter 34 of Mistborn: The Final Empire.",
    "35": "This is a spoiler-free summary for Chapter 35 of Mistborn: The Final Empire.",
    "36": "This is a spoiler-free summary for Chapter 36 of Mistborn: The Final Empire.",
    "37": "This is a spoiler-free summary for Chapter 37 of Mistborn: The Final Empire.",
    "38": "This is a spoiler-free summary for Chapter 38 of Mistborn: The Final Empire."
  }
}