{
  "book": {
    "title": "Mistborn: The Final Empire",
    "totalChapters": 38,
    "affiliateLink": "https://www.amazon.com/dp/0765350386?tag=profitfirstre-20"
  },
  "characters": [
    {
      "name": "Vin",
      "firstAppearance": 1,
      "featuredIn": [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Vin is a young street urchin who discovers she has Allomantic powers. Early on, she is cautious and mistrustful, surviving the streets of Luthadel."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Vin is a young street urchin who discovers she has Allomantic powers. She slowly grows more confident as she learns to use her abilities."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Vin is a young street urchin who discovers she has Allomantic powers. Vin becomes a key figure in the rebellion and trusted Mistborn."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Vin is a young street urchin who discovers she has Allomantic powers. Her determination and sense of loyalty define her as events reach their climax."
        }
      ]
    },
    {
      "name": "Kelsier",
      "firstAppearance": 1,
      "featuredIn": [
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Kelsier is a charismatic and daring Mistborn who leads the skaa rebellion. He is already a legend among the skaa, known for surviving the Pits of Hathsin."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Kelsier is a charismatic and daring Mistborn who leads the skaa rebellion. His confidence inspires the crew and Vin alike."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Kelsier is a charismatic and daring Mistborn who leads the skaa rebellion. Kelsier’s larger-than-life persona pushes the rebellion forward."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Kelsier is a charismatic and daring Mistborn who leads the skaa rebellion. Even after pivotal events, his legacy shapes everything around him."
        }
      ]
    },
    {
      "name": "Elend Venture",
      "firstAppearance": 1,
      "featuredIn": [
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Elend Venture is an idealistic nobleman who questions the corrupt society he was born into. He first appears as an unlikely ally with progressive ideas."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Elend Venture is an idealistic nobleman who questions the corrupt society he was born into. Elend’s respect for justice and books sets him apart from other nobles."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Elend Venture is an idealistic nobleman who questions the corrupt society he was born into. His relationship with Vin deepens as he supports the rebellion’s ideals."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Elend Venture is an idealistic nobleman who questions the corrupt society he was born into. He continues to evolve, stepping into leadership by the story’s end."
        }
      ]
    },
    {
      "name": "Sazed",
      "firstAppearance": 1,
      "featuredIn": [
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Sazed is a Terris Keeper, a scholar and servant dedicated to preserving knowledge. He serves as a guide to Vin and the crew, offering wisdom."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Sazed is a Terris Keeper, a scholar and servant dedicated to preserving knowledge. His deep understanding of religions and cultures adds depth to the rebellion’s efforts."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Sazed is a Terris Keeper, a scholar and servant dedicated to preserving knowledge. Sazed’s calm demeanor steadies those around him."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Sazed is a Terris Keeper, a scholar and servant dedicated to preserving knowledge. His quiet resolve remains even as the world changes."
        }
      ]
    },
    {
      "name": "Breeze",
      "firstAppearance": 1,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Breeze is a smooth-talking Soother who manipulates emotions with ease. He adds levity and charm to the crew’s efforts."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Breeze is a smooth-talking Soother who manipulates emotions with ease. Breeze’s easy manner hides a calculating mind."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Breeze is a smooth-talking Soother who manipulates emotions with ease. He provides valuable guidance during tense negotiations."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Breeze is a smooth-talking Soother who manipulates emotions with ease. His wit and practicality persist through the rebellion’s hardships."
        }
      ]
    },
    {
      "name": "Clubs",
      "firstAppearance": 1,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Clubs is a gruff Smoker who shields allies from magical detection. His blunt nature keeps the crew grounded."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Clubs is a gruff Smoker who shields allies from magical detection. Clubs is fiercely loyal and protective."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Clubs is a gruff Smoker who shields allies from magical detection. He becomes a steadfast figure as danger increases."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Clubs is a gruff Smoker who shields allies from magical detection. His practicality and courage never waver."
        }
      ]
    },
    {
      "name": "Spook",
      "firstAppearance": 1,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Spook is a young Tineye eager to prove himself. Initially shy, he seeks a role in the crew."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Spook is a young Tineye eager to prove himself. His skills as a scout and listener make him useful."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Spook is a young Tineye eager to prove himself. Spook slowly grows into his responsibilities."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Spook is a young Tineye eager to prove himself. He matures, showing quiet bravery."
        }
      ]
    },
    {
      "name": "Dockson",
      "firstAppearance": 1,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Dockson is the crew’s organizer, managing plans and logistics. Calm and practical, he keeps operations running."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Dockson is the crew’s organizer, managing plans and logistics. His reliability helps the crew stay on course."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Dockson is the crew’s organizer, managing plans and logistics. Dockson remains the backbone of the rebellion’s efforts."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Dockson is the crew’s organizer, managing plans and logistics. His level-headed approach steadies everyone else."
        }
      ]
    },
    {
      "name": "Ham",
      "firstAppearance": 1,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Ham is a philosophical Thug who blends strength with surprising thoughtfulness. He brings muscle and musings to the crew."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Ham is a philosophical Thug who blends strength with surprising thoughtfulness. His sense of humor and debate add warmth."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Ham is a philosophical Thug who blends strength with surprising thoughtfulness. Ham’s strength proves vital as threats grow."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Ham is a philosophical Thug who blends strength with surprising thoughtfulness. He remains a loyal, thoughtful ally."
        }
      ]
    },
    {
      "name": "Marsh",
      "firstAppearance": 1,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Marsh is Kelsier’s serious older brother and a skilled Seeker. He helps the crew with his knowledge of Allomancers."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Marsh is Kelsier’s serious older brother and a skilled Seeker. Marsh’s dedication to the cause is unwavering."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Marsh is Kelsier’s serious older brother and a skilled Seeker. His path takes a darker turn as he infiltrates the obligators."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Marsh is Kelsier’s serious older brother and a skilled Seeker. Marsh’s transformation leaves lasting questions."
        }
      ]
    },
    {
      "name": "Lord Ruler",
      "firstAppearance": 1,
      "featuredIn": [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "The Lord Ruler is the immortal, godlike tyrant who has ruled the Final Empire for centuries. His presence looms over every corner of the empire."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "The Lord Ruler is the immortal, godlike tyrant who has ruled the Final Empire for centuries. Rumors and fear surround his true nature."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "The Lord Ruler is the immortal, godlike tyrant who has ruled the Final Empire for centuries. The rebellion draws closer to challenging his reign."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "The Lord Ruler is the immortal, godlike tyrant who has ruled the Final Empire for centuries. His identity and power cast a long shadow over the story’s end."
        }
      ]
    },
    {
      "name": "Straff Venture",
      "firstAppearance": 1,
      "featuredIn": [
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Straff Venture is a cunning nobleman and the father of Elend Venture. Mentioned in passing, his influence is felt from afar."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Straff Venture is a cunning nobleman and the father of Elend Venture. His cold ambition defines him among nobles."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Straff Venture is a cunning nobleman and the father of Elend Venture. Straff’s distant scheming shapes events quietly."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Straff Venture is a cunning nobleman and the father of Elend Venture. He remains a looming figure even when not present."
        }
      ]
    },
    {
      "name": "Reen",
      "firstAppearance": 1,
      "featuredIn": [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Reen was Vin’s abusive older brother, whose lessons of mistrust haunt her. His voice echoes in Vin’s mind, warning her against trust."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Reen was Vin’s abusive older brother, whose lessons of mistrust haunt her. Memories of his harsh teachings linger."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Reen was Vin’s abusive older brother, whose lessons of mistrust haunt her. Reen’s influence shapes Vin’s caution."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Reen was Vin’s abusive older brother, whose lessons of mistrust haunt her. Even as she grows, his shadow lingers in her thoughts."
        }
      ]
    },
    {
      "name": "Kar",
      "firstAppearance": 1,
      "featuredIn": [
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Kar is a brutish Inquisitor, one of the Lord Ruler’s feared enforcers. His appearances are menacing and violent."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Kar is a brutish Inquisitor, one of the Lord Ruler’s feared enforcers. Kar embodies the terror of the Inquisitors."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Kar is a brutish Inquisitor, one of the Lord Ruler’s feared enforcers. His presence signals danger."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Kar is a brutish Inquisitor, one of the Lord Ruler’s feared enforcers. He is an enduring symbol of the empire’s brutality."
        }
      ]
    },
    {
      "name": "Captain Demoux",
      "firstAppearance": 1,
      "featuredIn": [
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Captain Demoux is a soldier who fights for the rebellion. Loyal and steady, he follows orders without complaint."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Captain Demoux is a soldier who fights for the rebellion. He earns the trust of the crew."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Captain Demoux is a soldier who fights for the rebellion. Demoux becomes a key figure in the Survivor’s forces."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Captain Demoux is a soldier who fights for the rebellion. His loyalty and honor never falter."
        }
      ]
    },
    {
      "name": "Lord Venture",
      "firstAppearance": 1,
      "featuredIn": [
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Lord Venture is the head of House Venture, a powerful noble house. He oversees his house’s vast influence."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Lord Venture is the head of House Venture, a powerful noble house. His political maneuvering affects the rebellion’s plans."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Lord Venture is the head of House Venture, a powerful noble house. Venture remains a symbol of noble power."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Lord Venture is the head of House Venture, a powerful noble house. His position defines much of the noble conflict."
        }
      ]
    },
    {
      "name": "Yeden",
      "firstAppearance": 1,
      "featuredIn": [
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20
      ],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 5,
          "text": "Yeden is the skaa rebellion’s leader, determined to overthrow the empire. He hires Kelsier’s crew to guide the uprising."
        },
        {
          "startChapter": 6,
          "endChapter": 15,
          "text": "Yeden is the skaa rebellion’s leader, determined to overthrow the empire. Yeden is zealous but inexperienced."
        },
        {
          "startChapter": 16,
          "endChapter": 30,
          "text": "Yeden is the skaa rebellion’s leader, determined to overthrow the empire. His fervor pushes the rebellion forward."
        },
        {
          "startChapter": 31,
          "endChapter": 38,
          "text": "Yeden is the skaa rebellion’s leader, determined to overthrow the empire. Yeden’s legacy endures in the cause."
        }
      ]
    }
  ],
  "recaps": {
    "1": "Vin survives on the streets of Luthadel, wary of everyone around her.",
    "2": "Kelsier, a daring crew leader, sets a bold plan into motion.",
    "3": "Vin begins to cross paths with Kelsier’s crew.",
    "4": "Hints of Vin’s hidden talents begin to surface.",
    "5": "The crew starts teaching Vin the basics of their world.",
    "6": "Kelsier’s legend grows as his plans for rebellion gain momentum.",
    "7": "Vin is drawn further into the crew’s schemes.",
    "8": "The noble houses’ power struggles become clearer.",
    "9": "Vin starts learning to trust her new allies.",
    "10": "The rebellion’s preparations deepen in secrecy.",
    "11": "Kelsier inspires the skaa with talk of hope.",
    "12": "Vin’s training challenges her to think differently.",
    "13": "The dangers of the empire become more visible.",
    "14": "Vin begins to step into a larger role in the crew.",
    "15": "Plans for a grand infiltration start taking shape.",
    "16": "Vin takes on a new identity for the rebellion’s purposes.",
    "17": "The crew sees progress in their daring plot.",
    "18": "Kelsier pushes the rebellion forward, despite risks.",
    "19": "Vin grows more confident among the nobility.",
    "20": "The empire’s grip on the city feels ever-present.",
    "21": "The stakes for Vin and the crew keep rising.",
    "22": "Allies are tested as the rebellion advances.",
    "23": "Vin sees firsthand the cost of their struggle.",
    "24": "The city stirs with unease as the crew’s plan unfolds.",
    "25": "Vin juggles her double life with growing skill.",
    "26": "The crew presses forward with their mission.",
    "27": "Danger edges closer to the rebellion’s members.",
    "28": "Tensions grow between the skaa and the nobility.",
    "29": "Vin feels the weight of the rebellion’s hopes.",
    "30": "The Lord Ruler’s shadow looms larger than ever.",
    "31": "The crew faces new, unexpected obstacles.",
    "32": "Vin is forced to take bigger risks.",
    "33": "The rebellion’s plans near their breaking point.",
    "34": "Vin’s path becomes even more dangerous.",
    "35": "Kelsier’s influence continues to shape the crew.",
    "36": "Vin steps fully into her power.",
    "37": "The final stages of the rebellion unfold.",
    "38": "The struggle for Luthadel comes to a head."
  }
}