{
  "title": "Mistborn",
  "books": {
    "final-empire": {
      "title": "The Final Empire",
      "chapters": 38,
      "characters": {
        "vin": {
          "name": "Vin",
          "appearsInChapters": [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "1": "A young thief from the streets of Luthadel who has lived a harsh life under her brother's crew. She discovers she has magical abilities and is recruited by a mysterious nobleman named Kelsier.",
            "5": "A young thief who has joined Kelsier's thieving crew and is learning about her Allomantic powers. She struggles with trusting others and finding her place among the crew.",
            "10": "A street thief turned noblewoman who is learning to navigate high society while training her Allomantic abilities. She poses as Valette Renoux to infiltrate noble society.",
            "15": "An Allomancer posing as noblewoman Valette Renoux who has grown more confident in her powers and social skills. She finds herself torn between her growing feelings for Elend and her loyalty to the crew.",
            "25": "A powerful Mistborn who has fully embraced her abilities and her role in Kelsier's plan to overthrow the Final Empire. She struggles with the violence required and her deepening relationship with Elend.",
            "35": "A skilled Mistborn who has become central to the rebellion against the Lord Ruler. She faces the ultimate test of her powers and must make difficult choices about her future and the fate of the empire."
          }
        },
        "kelsier": {
          "name": "Kelsier",
          "appearsInChapters": [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30],
          "descriptions": {
            "1": "A legendary thief and Mistborn known as the 'Survivor of Hathsin' who escaped the Lord Ruler's prison camps. He recruits Vin and plans an impossible heist to overthrow the immortal emperor.",
            "10": "The charismatic leader of a thieving crew who is training Vin in Allomancy while planning to steal the Lord Ruler's treasury. He carries deep hatred for the nobility and the Final Empire.",
            "20": "A powerful Mistborn leading a complex plan to destabilize the Final Empire through both theft and rebellion. He becomes increasingly radical in his methods and beliefs about overthrowing the social order.",
            "30": "The legendary Survivor whose plan to overthrow the Lord Ruler reaches its climax. His actions set in motion events that will forever change the Final Empire and leave a lasting impact on all who knew him."
          }
        },
        "elend": {
          "name": "Elend Venture",
          "appearsInChapters": [6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "6": "A young nobleman and heir to House Venture who is idealistic and dreams of political reform. He's often found reading philosophy books at noble parties instead of socializing.",
            "15": "An idealistic nobleman who has grown close to Valette Renoux (Vin) and shares his dreams of creating a better government. He remains unaware of her true identity as a thief and Mistborn.",
            "25": "A nobleman torn between his growing love for Valette and his duty to his house during the growing chaos in Luthadel. He continues to advocate for political reform despite the dangerous times.",
            "35": "A young nobleman who discovers Valette's true identity as Vin and must reconcile his feelings with the reality of her role in the rebellion. He faces the collapse of his world and the challenge of his idealistic beliefs."
          }
        },
        "dockson": {
          "name": "Dockson",
          "appearsInChapters": [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "2": "Kelsier's best friend and the crew's organizer who handles logistics and planning for their operations. He is a skilled non-Allomancer who shares Kelsier's hatred of the nobility.",
            "10": "The crew's practical organizer who manages the rebellion's logistics while maintaining his deep loyalty to Kelsier. He serves as a steady voice of reason among the more volatile crew members.",
            "20": "A trusted lieutenant in the rebellion who coordinates between different skaa factions and manages resources. His organizational skills prove crucial to the growing revolution against the Final Empire.",
            "35": "Kelsier's devoted friend who continues to support the crew's mission even after learning the full scope of their dangerous plan. He remains committed to seeing the rebellion through to its conclusion."
          }
        },
        "ham": {
          "name": "Hammond (Ham)",
          "appearsInChapters": [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "2": "A Pewterarm (Thug) in Kelsier's crew who possesses enhanced physical strength and endurance through Allomancy. He enjoys philosophical discussions and questioning the ethics of their actions.",
            "10": "A thoughtful warrior who serves as the crew's muscle while often engaging in philosophical debates about their methods. He struggles with the moral implications of their increasingly violent rebellion.",
            "20": "The rebellion's general who trains and leads the skaa army while continuing to question the ethics of their war. His combination of physical prowess and intellectual curiosity makes him a unique military leader.",
            "35": "A veteran commander who has guided the rebel army through numerous battles and proven his tactical abilities. He remains the crew's conscience, always questioning whether their violent methods are justified."
          }
        },
        "breeze": {
          "name": "Breeze",
          "appearsInChapters": [2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "2": "A Soother who can dampen emotions through Allomancy, known for his refined tastes and love of fine wine. He affects a nobleman's mannerisms despite his thieving background.",
            "10": "An elegant Soother who uses his Allomantic abilities to manipulate emotions during the crew's infiltration of noble society. His refined appearance and manners make him perfect for high-society operations.",
            "20": "A skilled emotional manipulator who helps coordinate the rebellion by influencing key figures throughout Luthadel. His Soothing abilities prove invaluable for managing both allies and enemies.",
            "35": "A master of emotional manipulation whose Allomantic skills have been crucial to the rebellion's success. Despite his dandified exterior, he has proven his loyalty and courage when it matters most."
          }
        },
        "clubs": {
          "name": "Clubs",
          "appearsInChapters": [3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "3": "A gruff Smoker who can create copperlouds to hide Allomantic activity, working as a carpenter while secretly protecting skaa Allomancers. He is Spook's uncle and known for his pessimistic outlook.",
            "10": "The crew's Smoker who provides crucial protection from Inquisitors while maintaining his carpenter's workshop as their base. His cynical attitude masks a deep care for the crew's safety.",
            "20": "A reliable Smoker whose coppercloud abilities are essential for hiding the rebellion's Allomantic activities from the Steel Inquisitors. His workshop serves as a safe haven for planning operations.",
            "35": "A veteran Smoker who has kept the crew safe from Inquisitor detection throughout their dangerous mission. His gruff exterior hides his genuine affection for his makeshift family of thieves."
          }
        },
        "spook": {
          "name": "Spook (Lestibournes)",
          "appearsInChapters": [3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "3": "A young Tineye with enhanced senses who speaks in confusing Eastern street slang and idolizes Kelsier. He is Clubs' nephew and the youngest member of the thieving crew.",
            "10": "An enthusiastic scout whose Tineye abilities make him invaluable for reconnaissance and surveillance. His strange dialect and hero-worship of Kelsier often amuse and confuse the other crew members.",
            "20": "A dedicated spy whose enhanced senses allow him to gather crucial intelligence for the rebellion. His unwavering loyalty to Kelsier and the crew drives him to take increasingly dangerous risks.",
            "35": "A young Tineye who has proven his worth as a scout and spy throughout the rebellion. His devotion to Kelsier's ideals and his unique way of speaking have made him a beloved member of the crew."
          }
        },
        "marsh": {
          "name": "Marsh",
          "appearsInChapters": [4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,36,37,38],
          "descriptions": {
            "4": "Kelsier's older brother and a Seeker who can detect Allomantic pulses, working as a spy within the Steel Ministry. He is more cautious and practical than his reckless younger brother.",
            "10": "A Seeker serving as an Obligator to spy on the Steel Ministry from within, providing crucial intelligence about Inquisitor movements. His infiltration puts him in constant danger of discovery.",
            "20": "An undercover agent whose position within the Ministry gives the rebellion access to vital information about government operations. His risky double life grows more dangerous as the rebellion escalates.",
            "36": "A Steel Inquisitor who was transformed by the Ministry but retained enough of his humanity to aid Vin in her final confrontation. His sacrifice proves crucial to defeating the Lord Ruler."
          }
        },
        "sazed": {
          "name": "Sazed",
          "appearsInChapters": [5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "5": "A Terris Keeper and scholar who serves as steward to Lord Renoux while secretly preserving ancient knowledge and religions. He is a Feruchemist with the ability to store and tap various attributes.",
            "10": "A knowledgeable Keeper who helps train Vin in combat and Allomancy while sharing his vast collection of stored religions and historical knowledge. His wisdom and fighting skills prove invaluable to the crew.",
            "20": "A dedicated scholar-warrior who serves as both teacher and protector, using his Feruchemical abilities in combat while preserving cultural knowledge. His guidance helps the crew navigate complex political and spiritual challenges.",
            "35": "A wise Keeper whose knowledge of history and religion provides crucial insights during the final confrontation with the Lord Ruler. His unique abilities and vast learning make him an indispensable ally."
          }
        },
        "oreseur": {
          "name": "OreSeur",
          "appearsInChapters": [14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38],
          "descriptions": {
            "14": "A kandra bound by Contract to impersonate Lord Renoux, serving as Vin's \"uncle\" in noble society. He is a shape-changing creature created by the Lord Ruler who can assume any form by consuming bones.",
            "20": "A skilled kandra who maintains the disguise of Lord Renoux while providing the crew with a legitimate noble identity. His shape-changing abilities and knowledge of noble customs are crucial to their infiltration.",
            "30": "A loyal kandra whose service to the crew goes beyond his Contract obligations, showing genuine care for their mission. His unique perspective as an immortal creature provides valuable insights into the Final Empire's history.",
            "35": "A kandra who has become a trusted ally despite the artificial nature of his creation. His loyalty to Vin and willingness to risk his existence for their cause demonstrates his evolved sense of duty and friendship."
          }
        },
        "lord-ruler": {
          "name": "The Lord Ruler (Rashek)",
          "appearsInChapters": [1,7,8,15,25,30,36,37,38],
          "descriptions": {
            "1": "The immortal emperor of the Final Empire who has ruled for a thousand years, believed to be a divine figure by most citizens. His tyrannical reign maintains strict social hierarchy between nobles and skaa.",
            "15": "An ancient and seemingly all-powerful ruler whose empire is built on the oppression of the skaa people. His immortality and vast powers make him appear undefeatable to most who oppose him.",
            "30": "The thousand-year emperor whose divine authority is being challenged by Kelsier's rebellion, though his true power and nature remain mysterious. The scope of his abilities suggests he is far more than a normal Allomancer.",
            "38": "The fallen emperor whose death at Vin's hands ends a millennium of tyranny, though the truth of his identity and motivations reveals a more complex figure than the simple tyrant he appeared to be."
          }
        },
        "straff": {
          "name": "Straff Venture",
          "appearsInChapters": [6,12,15,20,25,30,35,38],
          "descriptions": {
            "6": "Elend's father and head of House Venture, one of the most powerful noble houses in the Final Empire. He is a ruthless politician who views his son's idealism with disdain.",
            "15": "A calculating nobleman who seeks to use the growing chaos in Luthadel to increase his house's power and influence. His relationship with his idealistic son Elend is strained by their opposing worldviews.",
            "25": "A powerful noble house leader who recognizes the threats facing the Final Empire and positions himself to survive the coming changes. His political maneuvering puts him at odds with both the rebellion and other noble houses.",
            "38": "A pragmatic survivor who adapts to the new political reality following the Lord Ruler's death, though his relationship with his son remains complicated by their fundamental differences in values and vision."
          }
        },
        "shan": {
          "name": "Shan Elariel",
          "appearsInChapters": [8,12,15,18,20,25,30],
          "descriptions": {
            "8": "A noblewoman and Mistborn who is engaged to Elend Venture as part of a political alliance between their houses. She appears refined and proper in noble society.",
            "15": "Elend's fiancée who represents the traditional expectations of noble marriage and political alliance, contrasting with his growing interest in the mysterious Valette Renoux.",
            "20": "A Mistborn engaged to Elend who becomes suspicious of Valette's true nature and begins investigating her background. Her own Allomantic abilities make her a dangerous potential enemy.",
            "30": "A skilled Mistborn whose confrontation with Vin reveals her true deadly nature beneath her noble facade. Her engagement to Elend and her house's political ambitions drive her to eliminate perceived threats."
          }
        },
        "camon": {
          "name": "Camon",
          "appearsInChapters": [1,2],
          "descriptions": {
            "1": "The leader of a thieving crew who uses Vin's unconscious Allomantic abilities to help with his cons, though he doesn't understand what she's doing. He treats her poorly and takes credit for her contributions to his schemes.",
            "2": "A small-time thief whose crew is taken over by Kelsier after his failed scam with an Obligator. His harsh treatment of Vin and lack of understanding of her abilities demonstrate the brutal life she escaped from."
          }
        },
        "reen": {
          "name": "Reen",
          "appearsInChapters": [1,3,5,8,12,20,25],
          "descriptions": {
            "1": "Vin's older brother who taught her to trust no one and never rely on others before abandoning her to join another thieving crew. His harsh lessons about survival and paranoia shaped Vin's worldview.",
            "8": "Vin's absent brother whose voice she still hears in her head, warning her against trusting others. His teachings about betrayal and self-reliance continue to influence her even after joining Kelsier's crew.",
            "20": "The brother whose abandonment and harsh lessons continue to haunt Vin as she struggles to trust her new companions. His influence represents her internal conflict between isolation and belonging.",
            "25": "Vin's deceased brother whose memory and teachings she must overcome to fully embrace her new life and relationships. The revelation of his fate adds complexity to her understanding of trust and sacrifice."
          }
        },
        "yeden": {
          "name": "Yeden",
          "appearsInChapters": [7,10,15,20,25,28],
          "descriptions": {
            "7": "A skaa rebel leader who hires Kelsier's crew to rob the Lord Ruler's treasury to fund a rebellion against the Final Empire. He is passionate about freedom but lacks military experience.",
            "15": "The leader of the skaa rebellion who struggles with the realities of warfare and leadership while working with Kelsier's crew. His idealism often clashes with the practical necessities of revolution.",
            "20": "A dedicated rebel who serves as the nominal leader of the skaa army, though his lack of military experience creates challenges for the rebellion's success. His commitment to the cause never wavers despite the difficulties.",
            "28": "A fallen rebel leader whose death during a failed attack serves as a turning point for the rebellion, demonstrating the high cost of their fight against the Final Empire."
          }
        },
        "renoux": {
          "name": "Lord Renoux",
          "appearsInChapters": [5,8,12,15,18,20,25,30,35],
          "descriptions": {
            "5": "A reclusive nobleman whose identity is assumed by the kandra OreSeur to provide cover for Vin's infiltration of noble society. The real Renoux's estate serves as a base for the crew's operations.",
            "12": "The assumed identity that allows Vin to enter noble society as Valette Renoux, his supposed niece. This cover story provides legitimacy for her presence at balls and social gatherings.",
            "20": "A fabricated noble identity that has successfully established Vin in high society, though maintaining the deception requires constant vigilance from OreSeur and the crew.",
            "35": "The false identity that served as Vin's gateway into the noble world and her relationship with Elend, representing both her growth and the deceptions necessary for their mission's success."
          }
        },
        "demoux": {
          "name": "Captain Demoux",
          "appearsInChapters": [20,25,28,30,35,38],
          "descriptions": {
            "20": "A skaa soldier who serves in the rebellion's army and shows exceptional dedication to the cause. His loyalty and competence quickly earn him recognition among the rebels.",
            "28": "A capable military leader who has risen through the ranks of the rebel army due to his skill and unwavering commitment to Kelsier's cause. He begins to view the Survivor with religious devotion.",
            "35": "A devoted follower who has become one of the rebellion's most trusted military commanders, displaying both tactical ability and absolute faith in Kelsier's mission.",
            "38": "A loyal soldier whose devotion to Kelsier and the rebellion's ideals continues even after the Survivor's death, helping to establish the foundation for the Church of the Survivor."
          }
        }
      },
      "chapterSummaries": {
        "1": "Vin, a street thief, witnesses her thieving crew's interaction with a mysterious nobleman who demonstrates magical powers.",
        "2": "Kelsier recruits Vin and reveals the existence of Allomancy while beginning to train her in the magical arts.",
        "3": "Vin meets Kelsier's crew and begins learning about their plan to overthrow the immortal Lord Ruler.",
        "4": "The crew explains their roles and Vin starts understanding the scope of their impossible heist.",
        "5": "Vin begins training with Kelsier's crew and learns about her Allomantic abilities while struggling to trust her new companions.",
        "6": "Vin learns to fight and use Allomancy while the crew prepares for their infiltration of noble society.",
        "7": "The plan to infiltrate noble society begins as Vin learns about the broader political situation.",
        "8": "Vin's transformation into noblewoman Valette Renoux begins with lessons in deportment and dance.",
        "9": "Vin continues her noble training while learning more about Allomancy and the crew's various specialties.",
        "10": "Vin, now posing as noblewoman Valette Renoux, attends her first ball and meets the idealistic Elend Venture.",
        "11": "Vin grows more comfortable at noble balls while gathering intelligence and developing her relationship with Elend.",
        "12": "The crew's plans advance as political tensions in the city begin to escalate.",
        "13": "Vin's skills improve as she learns to balance her roles as thief, noblewoman, and Allomancer.",
        "14": "The kandra OreSeur is introduced and takes on the role of Lord Renoux to support their cover story.",
        "15": "The crew's plans advance as Vin grows more comfortable in noble society and her relationship with Elend deepens.",
        "16": "Vin discovers more about the Steel Inquisitors and the dangers they represent to Allomancers.",
        "17": "Political maneuvering among the noble houses intensifies as the crew gathers more intelligence.",
        "18": "Vin's Allomantic training progresses while she navigates increasingly complex social situations.",
        "19": "The crew begins to implement their plan to steal from the Lord Ruler's treasury.",
        "20": "The rebellion gains momentum as various plots converge, with Vin becoming more skilled and the crew facing increasing dangers.",
        "21": "Vin learns more about the history of the Final Empire and the Lord Ruler's thousand-year reign.",
        "22": "The crew's heist plans advance while Vin struggles with the violence required for their mission.",
        "23": "Political tensions reach a breaking point as noble houses begin to position themselves for conflict.",
        "24": "Vin discovers disturbing truths about her past while her relationship with Elend becomes more complicated.",
        "25": "Tensions rise in Luthadel as the crew's activities draw attention and Vin must balance her growing powers with difficult moral choices.",
        "26": "The crew prepares for their final assault on the Lord Ruler's palace and treasury.",
        "27": "Kelsier's true plan is revealed as he prepares to confront the Lord Ruler directly.",
        "28": "The skaa rebellion begins as Kelsier's influence spreads throughout the city.",
        "29": "Kelsier faces the Lord Ruler in combat while Vin and the crew execute their part of the plan.",
        "30": "Kelsier's final gambit unfolds as he confronts the Lord Ruler, setting in motion events that will change the empire forever.",
        "31": "The aftermath of Kelsier's sacrifice sends shockwaves through both the rebellion and the Final Empire.",
        "32": "Vin struggles to cope with Kelsier's death while the crew tries to hold their plans together.",
        "33": "The rebellion continues without Kelsier as Vin begins to step into a leadership role.",
        "34": "Vin discovers important clues about the Lord Ruler's true nature and vulnerabilities.",
        "35": "The final confrontation approaches as Vin faces the Lord Ruler and the truth about the prophecies and her destiny.",
        "36": "Vin infiltrates the Lord Ruler's palace for the climactic confrontation.",
        "37": "The battle with the Lord Ruler intensifies as Vin uses everything she has learned.",
        "38": "The climactic battle concludes with the fall of the Lord Ruler and the beginning of a new era for the Final Empire."
      }
    }
  }
}
