{
  "book": {
    "title": "Mistborn: The Well of Ascension",
    "totalChapters": 58,
    "affiliateLink": "https://www.amazon.com/dp/0765316889?tag=profitfirstre-20"
  },
  "characters": [
    {
      "name": "Vin",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Vin is a young Mistborn and former street urchin, now a central figure in Luthadel’s defense. At first, she struggles with the pressures of being a protector while adjusting to her new role in the city."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Vin is a young Mistborn and former street urchin, now a central figure in Luthadel’s defense. As her confidence grows, she becomes more assured in her power and her responsibilities."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Vin is a young Mistborn and former street urchin, now a central figure in Luthadel’s defense. She is viewed by many as a near-mythic guardian while still grappling with personal doubts and questions about the mists."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Vin is a young Mistborn and former street urchin, now a central figure in Luthadel’s defense. Her inner strength and determination shine through as she faces the mysteries of the Well of Ascension."
        }
      ]
    },
    {
      "name": "Elend Venture",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Elend Venture is an idealistic nobleman and the newly crowned king of Luthadel. In the early days of his reign, he is determined to rule with fairness and law rather than fear."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Elend Venture is an idealistic nobleman and the newly crowned king of Luthadel. He grows more pragmatic as he realizes that lofty ideals must be balanced with political reality."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Elend Venture is an idealistic nobleman and the newly crowned king of Luthadel. Elend’s belief in justice is tested by betrayals and sieges, and he learns to blend vision with resolve."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Elend Venture is an idealistic nobleman and the newly crowned king of Luthadel. Even as crises peak, he remains committed to his principles while adapting into a stronger, more capable leader."
        }
      ]
    },
    {
      "name": "Sazed",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Sazed is a Terris Keeper and devoted scholar, known for his calm wisdom and vast knowledge. Early on, he serves as an advisor and support for Vin and Elend."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Sazed is a Terris Keeper and devoted scholar, known for his calm wisdom and vast knowledge. He takes on a teaching role, even coaching Elend on rulership and philosophy."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Sazed is a Terris Keeper and devoted scholar, known for his calm wisdom and vast knowledge. His studies turn to the past as he seeks answers about the Deepness and the Hero of Ages."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Sazed is a Terris Keeper and devoted scholar, known for his calm wisdom and vast knowledge. Sazed’s commitment to truth and his role as a bridge to Terris culture become even more vital."
        }
      ]
    },
    {
      "name": "Breeze",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Breeze is a clever, silver-tongued Soother with a taste for luxury and dry humor. At first, he offers lighthearted counsel and keeps spirits up amid tension."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Breeze is a clever, silver-tongued Soother with a taste for luxury and dry humor. His humor remains sharp, though hints of weariness show through as the situation worsens."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Breeze is a clever, silver-tongued Soother with a taste for luxury and dry humor. Breeze proves himself as more than just a charmer, stepping into serious diplomacy when needed."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Breeze is a clever, silver-tongued Soother with a taste for luxury and dry humor. Through it all, his wit and subtle guidance help hold allies together."
        }
      ]
    },
    {
      "name": "Clubs",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Clubs is a gruff but loyal Smoker, shielding his allies from magical detection. Early on, he serves quietly but reliably in the background of the crew."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Clubs is a gruff but loyal Smoker, shielding his allies from magical detection. His steady vigilance remains key as tension rises in Luthadel."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Clubs is a gruff but loyal Smoker, shielding his allies from magical detection. Clubs shows steadfast courage as threats close in around the city."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Clubs is a gruff but loyal Smoker, shielding his allies from magical detection. His unwavering nature and protective instincts remain a pillar of the crew."
        }
      ]
    },
    {
      "name": "Spook",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Spook is the young Tineye of the crew, eager to prove himself beyond being just the 'kid'. In the beginning, he plays a small but reliable role in scouting and listening."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Spook is the young Tineye of the crew, eager to prove himself beyond being just the 'kid'. His confidence grows as his talents are increasingly relied upon."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Spook is the young Tineye of the crew, eager to prove himself beyond being just the 'kid'. Spook steps into larger responsibilities, showing bravery and initiative."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Spook is the young Tineye of the crew, eager to prove himself beyond being just the 'kid'. He continues to mature, earning the trust and respect of the others."
        }
      ]
    },
    {
      "name": "Dockson",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Dockson is the practical, level-headed organizer of the crew, handling logistics and planning. Early on, he remains the quiet backbone of their efforts."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Dockson is the practical, level-headed organizer of the crew, handling logistics and planning. He shoulders more burdens as the city’s governance becomes strained."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Dockson is the practical, level-headed organizer of the crew, handling logistics and planning. Dockson’s pragmatism keeps the group functioning through hardship."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Dockson is the practical, level-headed organizer of the crew, handling logistics and planning. His grounded leadership is a stabilizing presence to the end."
        }
      ]
    },
    {
      "name": "OreSeur / TenSoon",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "OreSeur is a kandra bound to Vin by contract, a shapeshifter who serves as her companion and aide. Initially, he follows her commands with dry sarcasm and detachment."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "OreSeur is a kandra bound to Vin by contract, a shapeshifter who serves as her companion and aide. His guarded personality begins to show cracks, revealing hints of deeper loyalty."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "OreSeur is a kandra bound to Vin by contract, a shapeshifter who serves as her companion and aide. Questions about trust and the kandra’s mysterious nature come to the forefront."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "OreSeur is a kandra bound to Vin by contract, a shapeshifter who serves as her companion and aide. His true identity as TenSoon emerges, reshaping Vin’s understanding of him."
        }
      ]
    },
    {
      "name": "Straff Venture",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Straff Venture is a powerful nobleman and the estranged father of Elend Venture. From the start, he is shown to be manipulative and coldly ambitious."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Straff Venture is a powerful nobleman and the estranged father of Elend Venture. His calculating nature becomes even more apparent as he exerts influence from the shadows."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Straff Venture is a powerful nobleman and the estranged father of Elend Venture. Straff’s ruthless pursuit of power defines him, caring little for anyone in his path."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Straff Venture is a powerful nobleman and the estranged father of Elend Venture. His relentless hunger for control and disregard for others remain constant to the very end."
        }
      ]
    },
    {
      "name": "Zane",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Zane is a Mistborn and Straff Venture’s illegitimate son, a figure shrouded in mystery and danger. Though initially unseen, his reputation and lethal skill begin to surface."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Zane is a Mistborn and Straff Venture’s illegitimate son, a figure shrouded in mystery and danger. When he steps into view, his volatile nature and conflicted loyalties challenge everyone around him."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Zane is a Mistborn and Straff Venture’s illegitimate son, a figure shrouded in mystery and danger. Zane’s charm is as unsettling as his capacity for violence, making him a dangerous enigma."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Zane is a Mistborn and Straff Venture’s illegitimate son, a figure shrouded in mystery and danger. His instability and intensity mark him as one of the most unpredictable forces in the story."
        }
      ]
    },
    {
      "name": "TenSoon",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "TenSoon is a kandra whose true identity is hidden behind other forms, bound by contract yet quietly distinct. (Not directly revealed early on.)"
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "TenSoon is a kandra whose true identity is hidden behind other forms, bound by contract yet quietly distinct. Subtle hints suggest that the kandra serving Vin is more complex than he appears."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "TenSoon is a kandra whose true identity is hidden behind other forms, bound by contract yet quietly distinct. The layers of his identity begin to peel away, showing glimpses of individuality beneath duty."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "TenSoon is a kandra whose true identity is hidden behind other forms, bound by contract yet quietly distinct. His reveal as TenSoon brings a new perspective to the bond between kandra and human."
        }
      ]
    },
    {
      "name": "Koloss",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Koloss are massive, brutal humanoids whose origins and purpose are shrouded in mystery. (Not seen early in the story.)"
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Koloss are massive, brutal humanoids whose origins and purpose are shrouded in mystery. Rumors begin to surface of monstrous creatures at the edges of the conflict."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Koloss are massive, brutal humanoids whose origins and purpose are shrouded in mystery. Their appearance confirms they are both terrifying and strangely pitiable."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Koloss are massive, brutal humanoids whose origins and purpose are shrouded in mystery. They remain a looming, unsettling reminder of twisted creation."
        }
      ]
    },
    {
      "name": "Jastes Lekal",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Jastes Lekal is an old acquaintance of Elend Venture, a nobleman trying to find his place in the new world. At first, he is mostly a distant ally with unclear intentions."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Jastes Lekal is an old acquaintance of Elend Venture, a nobleman trying to find his place in the new world. His ambitions and choices gradually come into focus as he plays a riskier game."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Jastes Lekal is an old acquaintance of Elend Venture, a nobleman trying to find his place in the new world. Jastes’ ties to dangerous forces complicate his identity as friend or foe."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Jastes Lekal is an old acquaintance of Elend Venture, a nobleman trying to find his place in the new world. His decisions have lasting impact on how he is remembered."
        }
      ]
    },
    {
      "name": "Marsh",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Marsh is Kelsier’s brother and a former obligator, now a Steel Inquisitor marked by his transformation. Early on, he remains largely unseen but his existence looms in memory."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Marsh is Kelsier’s brother and a former obligator, now a Steel Inquisitor marked by his transformation. Occasional glimpses remind the crew of his eerie, altered state."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Marsh is Kelsier’s brother and a former obligator, now a Steel Inquisitor marked by his transformation. Marsh appears as a grim, unpredictable figure torn between roles."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Marsh is Kelsier’s brother and a former obligator, now a Steel Inquisitor marked by his transformation. He embodies the uneasy question of what is left of the man beneath the spikes."
        }
      ]
    },
    {
      "name": "Tindwyl",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Tindwyl is a Terriswoman and a Keeper, known for her bluntness and deep knowledge. (Not present early on.)"
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Tindwyl is a Terriswoman and a Keeper, known for her bluntness and deep knowledge. Her arrival brings sharp counsel and cultural perspective."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Tindwyl is a Terriswoman and a Keeper, known for her bluntness and deep knowledge. Tindwyl’s teachings influence those around her, particularly Elend."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Tindwyl is a Terriswoman and a Keeper, known for her bluntness and deep knowledge. Her wisdom and strength leave a lasting mark even in hardship."
        }
      ]
    },
    {
      "name": "Captain Demoux",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Captain Demoux is a soldier of the Church of the Survivor and a loyal supporter of Elend’s cause. He serves faithfully in the early defense of Luthadel."
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Captain Demoux is a soldier of the Church of the Survivor and a loyal supporter of Elend’s cause. His dedication to Elend and Vin becomes more evident as danger rises."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Captain Demoux is a soldier of the Church of the Survivor and a loyal supporter of Elend’s cause. Demoux’s quiet courage earns him respect among soldiers and crew alike."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Captain Demoux is a soldier of the Church of the Survivor and a loyal supporter of Elend’s cause. He remains steadfast, a reminder of the ordinary men holding the city together."
        }
      ]
    },
    {
      "name": "Allrianne Cett",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Allrianne Cett is the lively daughter of King Cett, a noblewoman with unexpected boldness. (Not present early on.)"
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Allrianne Cett is the lively daughter of King Cett, a noblewoman with unexpected boldness. Her entrance brings an air of mischief and charm to tense situations."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Allrianne Cett is the lively daughter of King Cett, a noblewoman with unexpected boldness. Allrianne reveals wit and courage beneath her playful exterior."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Allrianne Cett is the lively daughter of King Cett, a noblewoman with unexpected boldness. She becomes an unlikely but endearing part of the larger struggle."
        }
      ]
    },
    {
      "name": "King Cett",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "King Ashweather Cett is a blunt, pragmatic warlord-king seeking his own advantage. (Not present early on.)"
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "King Ashweather Cett is a blunt, pragmatic warlord-king seeking his own advantage. His arrival in Luthadel adds a new and abrasive political force."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "King Ashweather Cett is a blunt, pragmatic warlord-king seeking his own advantage. Cett’s straightforward but self-serving nature defines his rule."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "King Ashweather Cett is a blunt, pragmatic warlord-king seeking his own advantage. Even in chaos, his self-interest remains his guiding principle."
        }
      ]
    },
    {
      "name": "Aradan Yomen",
      "firstAppearance": 1,
      "featuredIn": [],
      "descriptions": [
        {
          "startChapter": 1,
          "endChapter": 10,
          "text": "Aradan Yomen is a nobleman of remarkable composure and subtlety, representing Fadrex City. (Not present early on.)"
        },
        {
          "startChapter": 11,
          "endChapter": 30,
          "text": "Aradan Yomen is a nobleman of remarkable composure and subtlety, representing Fadrex City. His name is first mentioned as a rising power."
        },
        {
          "startChapter": 31,
          "endChapter": 50,
          "text": "Aradan Yomen is a nobleman of remarkable composure and subtlety, representing Fadrex City. Yomen’s calm and calculated demeanor suggests hidden depths."
        },
        {
          "startChapter": 51,
          "endChapter": 58,
          "text": "Aradan Yomen is a nobleman of remarkable composure and subtlety, representing Fadrex City. He stands out as a measured figure in a world of extremes."
        }
      ]
    }
  ],
  "recaps": {
    "1": "",
    "2": "",
    "3": "",
    "4": "",
    "5": "",
    "6": "",
    "7": "",
    "8": "",
    "9": "",
    "10": "",
    "11": "",
    "12": "",
    "13": "",
    "14": "",
    "15": "",
    "16": "",
    "17": "",
    "18": "",
    "19": "",
    "20": "",
    "21": "",
    "22": "",
    "23": "",
    "24": "",
    "25": "",
    "26": "",
    "27": "",
    "28": "",
    "29": "",
    "30": "",
    "31": "",
    "32": "",
    "33": "",
    "34": "",
    "35": "",
    "36": "",
    "37": "",
    "38": "",
    "39": "",
    "40": "",
    "41": "",
    "42": "",
    "43": "",
    "44": "",
    "45": "",
    "46": "",
    "47": "",
    "48": "",
    "49": "",
    "50": "",
    "51": "",
    "52": "",
    "53": "",
    "54": "",
    "55": "",
    "56": "",
    "57": "",
    "58": ""
  }
}