{
  "meta": {
    "title": "The Chamber of Secrets",
    "author": "J.K. Rowling",
    "chapters": 18,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {},
  "recaps": {
    "1": "Harry spends his worst birthday at the Dursleys, where Uncle Vernon forbids talk of magic and tensions rise over Harry's pet owl. Strange warnings circulate in the wizarding world about potential danger at Hogwarts.",
    "2": "Dobby the house-elf visits Harry and urgently warns him not to return to Hogwarts, causing chaos at dinner. Harry is locked in his room after Dobby disrupts the household magically.",
    "3": "Ron, Fred, and George Weasley rescue Harry in their flying car and take him to the Burrow. Harry finds the Weasleys' home warm and welcoming compared to the Dursleys.",
    "4": "Harry and the Weasleys go to Diagon Alley where he meets Gilderoy Lockhart. Lucius Malfoy causes tension by seeming to tamper with Ginny's school supplies before term begins.",
    "5": "Harry and Ron miss Platform 9¾ and fly the enchanted Ford Anglia to Hogwarts. They crash into the Whomping Willow just outside school grounds.",
    "6": "Gilderoy Lockhart begins teaching Defence Against the Dark Arts, introducing class curiosities like Cornish Pixies. Draco's insults trigger an early conflict and a mysterious voice haunts Harry.",
    "7": "Harry practices Quidditch and starts detention after a prank goes wrong. He hears the strange voice again and suspicions rise around attacks at Hogwarts.",
    "8": "Hagrid hosts a Deathday Party for Nearly Headless Nick in the dungeons. Meanwhile, more warning messages appear on the Hogwarts walls.",
    "9": "A petrified cat and a scrawled threat about the Chamber of Secrets alarm the school. Rumors swirl that the heir of Slytherin is targeting Muggle-born students.",
    "10": "During a Quidditch match, a rogue Bludger attacks Harry, breaking his arm. Lockhart's attempt to heal him backfires spectacularly, sending Harry to the hospital wing.",
    "11": "Lockhart starts a Dueling Club where Harry shocks classmates by speaking Parseltongue. He and Ron serve detention together.",
    "12": "Hermione begins brewing Polyjuice Potion so the trio can gather information undercover. Harry and Ron help with tricky magical research.",
    "13": "Harry and Ron discover the diary belonging to Tom Riddle in Moaning Myrtle's bathroom. The entry hints at the Chamber of Secrets being real.",
    "14": "Minister Fudge visits Hogwarts, removes Dumbledore from his post, and takes Hagrid away. Hogwarts feels more tense and uncertain.",
    "15": "Harry and Ron venture into the Forbidden Forest following a lead, find Aragog the spider, and learn more about the creature in the Chamber. They narrowly escape danger.",
    "16": "Hermione confirms the monster is a basilisk, then Ginny goes missing. Harry and Ron prepare to enter the Chamber to rescue her.",
    "17": "Harry and Ron confront the situation in the Chamber and force Lockhart to accompany them. They locate Ginny and confront the person controlling the Chamber's events.",
    "18": "Harry resolves the crisis in the Chamber, Ginny awakens safely, and Dobby is freed from servitude. The petrified students are cured and the school year concludes peacefully."
  }
}
