{
  "meta": {
    "title": "The Deathly Hallows",
    "author": "J.K. Rowling",
    "chapters": 37,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {},
  "recaps": {
    "1": "Voldemort meets with his Death Eaters and takes Lucius Malfoy's wand. Plans for Harry's capture intensify.",
    "2": "Harry prepares to leave Privet Drive for good, packing his belongings and reflecting on Dumbledore's death. He says farewell to the Dursleys.",
    "3": "The Order of the Phoenix arrives to escort Harry away using decoys. They transform into multiple Harrys with Polyjuice Potion.",
    "4": "Death Eaters attack during the escape. Hedwig is killed and Harry barely makes it to safety.",
    "5": "The survivors regroup at the Burrow, mourning their losses. Harry feels guilt over the dangers faced by his friends.",
    "6": "The Weasleys prepare for Bill and Fleur's wedding. Harry, Ron, and Hermione plan for their mission.",
    "7": "The wedding is interrupted by news that the Ministry has fallen. Death Eaters arrive, forcing Harry and his friends to flee.",
    "8": "Harry, Ron, and Hermione hide out in a Muggle café before moving to Grimmauld Place. They search for clues about Voldemort's Horcruxes.",
    "9": "They discover R.A.B.'s identity and explore Sirius's old room for leads. Kreacher reluctantly begins to help them.",
    "10": "Harry, Ron, and Hermione interrogate Mundungus Fletcher about stolen items. Kreacher warms to Harry after being shown kindness.",
    "11": "The trio infiltrates the Ministry disguised with Polyjuice Potion to retrieve the Horcrux locket. They escape with difficulty.",
    "12": "They go into hiding again and feel the pressure of being constantly on the run. Tension grows among the three friends.",
    "13": "Ron, frustrated by their lack of progress, leaves the group. Harry and Hermione continue searching alone.",
    "14": "Harry and Hermione visit Godric's Hollow and see the graves of Harry's parents. They narrowly escape Nagini's ambush.",
    "15": "Hermione accidentally breaks Harry's wand while defending them. Harry feels more vulnerable without it.",
    "16": "A mysterious silver doe Patronus leads Harry to the Sword of Gryffindor under a frozen lake. Ron returns and saves Harry from drowning.",
    "17": "Ron destroys the Horcrux locket with the sword. The friends reconcile and continue their search.",
    "18": "They visit Xenophilius Lovegood to learn about the symbol Hermione keeps seeing. He tells them about the Deathly Hallows legend.",
    "19": "Death Eaters capture Luna and pressure Xenophilius. The trio narrowly escapes another trap.",
    "20": "The Snatchers capture Harry, Ron, and Hermione. They are taken to Malfoy Manor.",
    "21": "Bellatrix Lestrange tortures Hermione for information. Dobby the house-elf helps them escape but is killed in the process.",
    "22": "They bury Dobby and regroup at Shell Cottage. Plans are made to break into Gringotts.",
    "23": "The trio, with Griphook's help, infiltrates Gringotts disguised by Polyjuice Potion. They retrieve the cup Horcrux and escape on a dragon.",
    "24": "Harry has visions from Voldemort's mind that lead them to Hogwarts. They return to the school to find the next Horcrux.",
    "25": "Dumbledore's Army and the Order gather at Hogwarts. Teachers prepare to defend the castle against Voldemort's forces.",
    "26": "The Battle of Hogwarts begins with Death Eaters attacking the school. Students, staff, and allies fight back fiercely.",
    "27": "Voldemort calls for Harry, demanding his surrender to stop more bloodshed. Casualties weigh heavily on Harry.",
    "28": "Harry learns the truth about Snape's loyalties through his memories. He discovers he must sacrifice himself to defeat Voldemort.",
    "29": "Harry walks into the forest and allows Voldemort to strike him down. He has a surreal encounter with Dumbledore in a dreamlike King's Cross.",
    "30": "Harry awakens and pretends to be dead while Voldemort shows his body to the defenders. A final confrontation looms.",
    "31": "The final battle erupts in the Great Hall. Voldemort is ultimately defeated as his own curse rebounds.",
    "32": "Peace returns to Hogwarts. Harry reflects on the losses and quietly plans his future with his friends.",
    "33": "The wizarding world begins to rebuild. Harry visits Dumbledore's portrait for guidance.",
    "34": "Funerals are held for those who died in battle. The community comes together in grief and hope.",
    "35": "Harry repairs his original wand using the Elder Wand. He decides the Elder Wand should remain with Dumbledore.",
    "36": "Life slowly returns to normal. Harry, Ron, and Hermione consider their futures beyond Hogwarts.",
    "37": "Nineteen years later, Harry and Ginny send their children to Hogwarts. The scar has not pained Harry since Voldemort's defeat."
  }
}
