{
  "meta": {
    "title": "The Goblet of Fire",
    "author": "J.K. Rowling",
    "chapters": 37,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {},
  "recaps": {
    "1": "At the Riddle House, villagers whisper about the mysterious deaths of the Riddle family. An old gardener overhears a strange meeting inside the house involving Voldemort and his servant.",
    "2": "Harry wakes from a disturbing dream about Voldemort and writes to Sirius Black for advice. The Dursleys largely ignore Harry as he prepares for the rest of the summer.",
    "3": "The Weasleys arrive via Floo Powder to collect Harry, accidentally wrecking the Dursleys' living room. Harry happily leaves Privet Drive with them.",
    "4": "Harry enjoys his stay at the Burrow while the Weasleys prepare for the Quidditch World Cup. He hears more rumors about rising dark magic activity.",
    "5": "Harry, Hermione, and the Weasleys travel by Portkey to the Quidditch World Cup. They arrive at the enormous, bustling campsite full of magical tents and wizards from around the world.",
    "6": "They watch the exciting Quidditch World Cup match between Ireland and Bulgaria. Viktor Krum impresses the crowd despite his team's loss.",
    "7": "That night, chaos erupts as masked wizards attack the campsite. A mysterious symbol, the Dark Mark, appears in the sky, frightening everyone.",
    "8": "The Ministry investigates the attack and interrogates Winky the house-elf. Harry notices his wand is missing and later found at the scene of the Dark Mark.",
    "9": "Back at the Burrow, tension lingers about the World Cup incident. Letters arrive from Hogwarts with unexpected news about the coming school year.",
    "10": "On the way to Hogwarts, Harry, Ron, and Hermione overhear talk about the Triwizard Tournament. They learn visiting schools will compete for glory.",
    "11": "Students from Beauxbatons and Durmstrang arrive at Hogwarts in grand magical fashion. Their headmasters, Madame Maxime and Igor Karkaroff, make strong impressions.",
    "12": "Dumbledore announces the Triwizard Tournament and introduces the Goblet of Fire. He explains the age limit and rules for entering.",
    "13": "The Halloween feast ends with students submitting names into the Goblet. Everyone speculates who will be chosen as champion.",
    "14": "The Goblet selects Viktor Krum, Fleur Delacour, and Cedric Diggory as champions—then unexpectedly produces a fourth name: Harry Potter.",
    "15": "Shock spreads as Harry is forced into the tournament. He insists he never entered his name, but most students doubt him.",
    "16": "Harry struggles under the unwanted attention and skepticism from classmates. Only Ron and Hermione debate how he was entered.",
    "17": "Harry learns more about the tournament tasks from Hagrid. He begins to understand the danger involved.",
    "18": "Rita Skeeter interviews Harry for the Daily Prophet, twisting his words. Harry feels the pressure of unwanted fame again.",
    "19": "Harry discovers the first task involves dragons. Hagrid secretly shows him the dangerous creatures in the forest.",
    "20": "Harry warns Cedric about the dragons as a show of good sportsmanship. He searches for a spell to help him survive the task.",
    "21": "Harry faces the dragon, summoning his broom with Accio. He successfully retrieves the golden egg and earns applause.",
    "22": "After the task, Harry gains new respect from classmates. The golden egg's screeching clue puzzles him.",
    "23": "Ron apologizes for doubting Harry and their friendship is restored. Hermione pushes them to solve the egg's riddle.",
    "24": "The Yule Ball is announced, and students scramble for dates. Harry nervously asks Cho, but she already has a partner.",
    "25": "The Yule Ball takes place with music and dancing. Harry and Ron have awkward dates but observe intriguing interactions among the adults.",
    "26": "Harry learns about past Death Eaters during a conversation with Karkaroff and Snape. Suspicion grows around several professors.",
    "27": "Harry works to solve the egg clue, but progress is slow. Moaning Myrtle offers unexpected help.",
    "28": "Harry cracks the egg clue and learns he must recover something valuable from the Black Lake. He prepares for the second task.",
    "29": "Harry completes the second task using gillyweed from Dobby. He rescues Ron and earns high marks for moral judgment.",
    "30": "Tension rises as the third task nears and strange happenings plague Hogwarts. Rita Skeeter causes more trouble with her gossip.",
    "31": "The champions enter the maze for the third task. Harry and Cedric face dangerous creatures and enchanted obstacles.",
    "32": "Harry and Cedric seize the Triwizard Cup together, but it transports them elsewhere. They realize too late it is a Portkey.",
    "33": "Harry witnesses a terrifying ritual that restores Voldemort to physical form. Voldemort calls his followers, the Death Eaters.",
    "34": "Voldemort duels Harry in a graveyard. Their wands connect in a strange magical clash that allows Harry to escape with Cedric's body.",
    "35": "Harry returns to Hogwarts carrying Cedric's body. Panic and grief spread through the crowd.",
    "36": "Dumbledore comforts Harry and listens to his story. The Ministry begins to deny Voldemort's return.",
    "37": "The school year ends in uncertainty. Harry prepares to return to Privet Drive with Voldemort's return weighing heavily."
  }
}
