{
  "meta": {
    "title": "The Half-Blood Prince",
    "author": "J.K. Rowling",
    "chapters": 30,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {},
  "recaps": {
    "1": "The Muggle Prime Minister meets the Minister for Magic, who updates him on the rise of dark magic. News of attacks and disappearances spreads fear.",
    "2": "Snape hosts Narcissa Malfoy and Bellatrix Lestrange at his home. Snape makes an unbreakable vow to help Draco with a mysterious mission.",
    "3": "Dumbledore collects Harry from the Dursleys and warns them to treat him better. He takes Harry on a visit before heading to the Burrow.",
    "4": "Dumbledore and Harry visit Horace Slughorn, convincing him to return to Hogwarts as Potions Master. Harry notices Slughorn's fondness for collecting well-connected students.",
    "5": "Harry reunites with the Weasleys at the Burrow. The group discusses Voldemort's growing threat and the danger facing the wizarding world.",
    "6": "At Diagon Alley, Harry sees Draco Malfoy acting suspiciously. He begins to suspect Draco is working for Voldemort.",
    "7": "On the train to Hogwarts, Harry sneaks into Malfoy's compartment and overhears his boasting. Malfoy catches Harry spying and hexes him.",
    "8": "Classes begin, and Slughorn takes Harry into his Slug Club. Snape finally becomes Defence Against the Dark Arts teacher.",
    "9": "Harry finds an old Potions textbook full of helpful notes signed 'The Half-Blood Prince.' He uses the tips to excel in class.",
    "10": "Dumbledore gives Harry private lessons exploring Voldemort's past through memories. Harry begins to see how Voldemort grew into a dark wizard.",
    "11": "Harry suspects Draco of plotting something dangerous. He starts keeping an eye on Malfoy around school.",
    "12": "Romantic tensions brew among students. Ginny dates Dean, Ron dates Lavender, and jealousy surfaces everywhere.",
    "13": "Harry and Dumbledore view more memories of Voldemort's youth, piecing together his quest for power. A pattern begins to emerge.",
    "14": "Harry grows more obsessed with Draco's secret mission. He follows him under the Invisibility Cloak but finds little proof.",
    "15": "Ron is poisoned after drinking mead meant for Dumbledore. Harry saves him with a quick antidote.",
    "16": "Harry learns about Horcruxes in another lesson with Dumbledore. He realizes Voldemort split his soul to achieve immortality.",
    "17": "Harry convinces Slughorn to share a crucial memory about Voldemort. It reveals Voldemort made multiple Horcruxes.",
    "18": "Harry continues watching Draco and suspects he is using the Room of Requirement. Tension grows as attacks increase outside school.",
    "19": "Harry and Ginny finally get together after a Quidditch match. Their relationship blossoms quickly.",
    "20": "Dumbledore and Harry retrieve a locket Horcrux from a dangerous cave. Dumbledore weakens himself drinking a potion protecting it.",
    "21": "They return to Hogwarts and find the Dark Mark above the Astronomy Tower. Harry hides as Draco confronts Dumbledore.",
    "22": "Snape kills Dumbledore during the confrontation, shocking everyone. Death Eaters flee the castle.",
    "23": "The Hogwarts community mourns Dumbledore's death. Harry vows to continue the mission to find and destroy Voldemort's Horcruxes.",
    "24": "Harry breaks up with Ginny to protect her. He, Ron, and Hermione plan to leave school to hunt Horcruxes instead of returning next year.",
    "25": "Funeral preparations begin for Dumbledore. Wizards from across the world arrive to pay respects.",
    "26": "Harry discovers the locket they retrieved was fake. A note from R.A.B. reveals someone else tried to destroy the real Horcrux.",
    "27": "The funeral takes place by the lake. Harry watches as Dumbledore is laid to rest in a white tomb.",
    "28": "Harry searches Dumbledore's office for clues. He finds nothing but feels the weight of continuing alone.",
    "29": "Students pack to leave Hogwarts early. The future of the school remains uncertain without Dumbledore.",
    "30": "Harry, Ron, and Hermione solidify their plans. They will hunt for Horcruxes together, starting with finding R.A.B.'s identity."
  }
}
