{
  "meta": {
    "title": "The Order of the Phoenix",
    "author": "J.K. Rowling",
    "chapters": 38,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {},
  "recaps": {
    "1": "Harry and Dudley are attacked by Dementors in Little Whinging. Harry uses magic to save them, causing trouble with the Ministry.",
    "2": "Harry faces punishment from Uncle Vernon and Aunt Petunia, but receives mysterious howlers urging Petunia to keep him safe.",
    "3": "The Order of the Phoenix rescues Harry and takes him to 12 Grimmauld Place, Sirius Black's family home.",
    "4": "Harry learns about the Order and its fight against Voldemort. Tension grows between the adults and Harry's friends.",
    "5": "Harry reunites with Ron and Hermione, but grows frustrated about being left out of important discussions. The house is cleaned of dark objects.",
    "6": "The group heads to the Ministry for Harry's disciplinary hearing. Arthur Weasley escorts him through London.",
    "7": "Harry's hearing takes place. Dumbledore intervenes, and Harry is cleared of charges for using magic in front of Muggles.",
    "8": "The group prepares for the new Hogwarts year, and Harry notices tension about Voldemort's return. The Order warns of danger ahead.",
    "9": "Harry boards the train to Hogwarts and faces stares from skeptical students. He feels isolated by rumors.",
    "10": "Professor Umbridge gives a dull and controlling first lesson as the new Defence Against the Dark Arts teacher. Her refusal to teach practical spells alarms students.",
    "11": "Harry clashes with Umbridge and gets detention, forced to write lines painfully etched into his skin. He struggles with anger and isolation.",
    "12": "Fred and George begin testing joke products on students. Harry has disturbing dreams connected to Voldemort.",
    "13": "Umbridge gains more authority at Hogwarts as 'High Inquisitor.' She evaluates teachers and imposes new rules.",
    "14": "Hermione suggests forming a secret Defence group. Harry reluctantly agrees to teach his classmates.",
    "15": "Dobby helps Harry find a secret room—the Room of Requirement—for their lessons. The group names themselves Dumbledore's Army.",
    "16": "Harry teaches the DA defensive spells in secret. Students grow more confident with each meeting.",
    "17": "Umbridge cracks down further on rule-breaking. Quidditch tensions rise as she bans players.",
    "18": "Harry has a dream of a snake attacking Arthur Weasley. He warns the Order, and Arthur is rescued.",
    "19": "Harry spends Christmas at Grimmauld Place. He fears his connection to Voldemort's mind is dangerous.",
    "20": "Back at Hogwarts, DA meetings continue. Hagrid returns with mysterious injuries from a mission.",
    "21": "Snape begins Occlumency lessons with Harry to block Voldemort's visions. Harry struggles with the difficult practice.",
    "22": "Fred and George escalate pranks as Umbridge's rules tighten. The DA keeps training despite the risk.",
    "23": "Umbridge discovers the DA after a betrayal. Dumbledore takes responsibility and escapes to avoid arrest.",
    "24": "Umbridge becomes Headmistress, increasing her control. Students find creative ways to resist her authority.",
    "25": "Fred and George unleash chaos in Hogwarts and leave school triumphantly. Peeves continues their rebellion.",
    "26": "Harry's visions of the Department of Mysteries grow stronger. He sees Sirius in danger and panics.",
    "27": "Harry, Ron, Hermione, and friends fly to London to rescue Sirius. They infiltrate the Ministry of Magic.",
    "28": "The group finds the Hall of Prophecies and are ambushed by Death Eaters. A battle erupts in the Department of Mysteries.",
    "29": "Members of the Order arrive to help. The fight intensifies, and Sirius is struck and falls through the veil.",
    "30": "Dumbledore duels Voldemort in the Ministry. Harry witnesses the fight and Voldemort's escape.",
    "31": "The truth about the prophecy is revealed to Harry: he and Voldemort are linked by destiny. The year ends in grief and uncertainty.",
    "32": "Harry processes his grief over Sirius's death. The wizarding world finally acknowledges Voldemort's return.",
    "33": "Students prepare to leave Hogwarts for summer. Harry receives unexpected support from classmates who now believe him.",
    "34": "Dumbledore shares more details about the prophecy with Harry. Their relationship begins to heal after the year's tensions.",
    "35": "The DA members reflect on their year of secret training. Many vow to continue practicing over the summer.",
    "36": "Harry packs his belongings, including items inherited from Sirius. He prepares mentally for the war ahead.",
    "37": "Order members escort Harry back to Privet Drive. They warn the Dursleys to treat Harry well.",
    "38": "Harry returns to the Dursleys with new determination. He knows the fight against Voldemort has truly begun."
  }
}
