{
  "meta": {
    "title": "The Philosopher's Stone",
    "author": "J.K. Rowling",
    "chapters": 17,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {},
  "recaps": {
    "1": "We meet the Dursley family living a very ordinary life, while strange magical occurrences hint at something unusual brewing. That night, a baby named Harry Potter is left at their doorstep by Dumbledore and McGonagall.",
    "2": "Harry grows up living under the stairs and endures mistreatment from the Dursleys. He begins receiving mysterious letters which his uncle Vernon desperately tries to stop him reading.",
    "3": "The letters flood the house until the Dursleys flee to a remote hut. Hagrid arrives, reveals to Harry that he is a wizard, and gives him a letter inviting him to Hogwarts.",
    "4": "Harry visits Diagon Alley with Hagrid and buys his school supplies, getting his first wand and meeting familiar magical landmarks. He also receives an owl named Hedwig.",
    "5": "Harry boards the Hogwarts Express at King's Cross, where he meets Ron Weasley, Hermione Granger and others in his year. They become fast friends and share stories while traveling.",
    "6": "At Hogwarts the students are sorted into houses by the Sorting Hat; Harry, Ron, and Hermione are placed into Gryffindor. Harry spends his first magical feast with his new classmates.",
    "7": "Harry has his first flying lesson and demonstrates remarkable skill. Oliver Wood notices him and recommends him for the Gryffindor Quidditch team.",
    "8": "Harry receives his first broomstick and plays his first Quidditch match, where he helps Gryffindor win unexpectedly. Questions arise about Snape's behavior during the match.",
    "9": "On Halloween, a troll enters Hogwarts. Harry and Ron save Hermione from the troll, cementing their friendship in a dangerous encounter.",
    "10": "Hermione shows her cleverness by brewing a complex potion and solving a logic puzzle. She joins Harry and Ron's friend group more closely.",
    "11": "Harry receives a mysterious object from Hagrid and hears about a three-headed dog guarding a trapdoor at Hogwarts. The group begins to wonder what it might be protecting.",
    "12": "Harry sees an enchanted mirror called the Mirror of Erised that shows people what they desire most. He becomes intrigued and visits it again later.",
    "13": "The trio discovers that the mysterious object is the Philosopher's Stone, created by Nicolas Flamel. They learn more about its powers and importance.",
    "14": "Harry and Hermione serve detention in the Forbidden Forest and encounter a wounded unicorn and a cloaked figure drinking its blood. They return shaken.",
    "15": "Harry, Ron, and Hermione realize someone is trying to steal the Stone and decide to act. They prepare to visit the trapdoor guarded by the three-headed dog.",
    "16": "Harry faces Professor Quirrell in the chamber below the trapdoor and manages to protect the Stone. He awakens in the school infirmary afterward.",
    "17": "Dumbledore explains Harry's survival and the fate of the Stone. The year ends with a celebration and Harry prepares to return home to the Dursleys for the summer."
  }
}
