{
  "meta": {
    "title": "The Prisoner of Azkaban",
    "author": "J.K. Rowling",
    "chapters": 22,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {},
  "recaps": {
    "1": "Harry quietly struggles through homework late at night on his thirteenth birthday at the Dursleys. He learns via owl post that Sirius Black, a dangerous prisoner, has escaped Azkaban.",
    "2": "Harry accidentally inflates Aunt Marge in anger and panics. He flees Privet Drive after the accident.",
    "3": "Harry boards the Knight Bus and travels to the Leaky Cauldron in London. He meets Minister Fudge who warns him about Sirius Black.",
    "4": "Harry spends time at the Leaky Cauldron as the school year nears. He sees owls delivering mail and senses unease about Black's escape.",
    "5": "Dementors are stationed on the Hogwarts Express and Harry faints upon their approach. Professor Lupin intervenes to cast them away.",
    "6": "At Hogwarts, Lupin is introduced as the new Defence Against the Dark Arts teacher. Harry hears unsettling stories about Black.",
    "7": "Hagrid brings Buckbeak the hippogriff for class. Malfoy provokes Buckbeak and gets injured.",
    "8": "During Hagrid's defence, Filch mistakenly curses Buckbeak. Harry and Hermione plead for the creature's safety.",
    "9": "Dementors guard the school grounds and Harry continues to faint near them. Lupin offers to give Harry private lessons.",
    "10": "Harry begins Patronus Charm lessons with Lupin after experiencing more Dementor effects. He grows determined to learn the spell.",
    "11": "Fred and George gift Harry the Marauder's Map, revealing Hogwarts' secret passages. Harry discovers a hidden route into Hogsmeade.",
    "12": "Harry visits Hogsmeade via the secret tunnel and overhears a conversation that identifies Sirius Black as a betrayer. He learns Black was close to his parents.",
    "13": "Tension mounts at the castle as Sirius threatens the school. Harry remains unsettled by the looming danger.",
    "14": "Buckbeak is sentenced to execution after the hearing. Harry, Ron, and Hermione are distressed by the ruling.",
    "15": "Scabbers disappears from Ron's dormitory and Crookshanks appears agitated. Hermione suspects the cat is behind the rat's disappearance.",
    "16": "Ron is attacked and dragged into a tunnel under the Whomping Willow. Harry and Hermione follow to rescue him.",
    "17": "Harry and Hermione reach the Shrieking Shack and encounter a large black dog. Lupin arrives and confronts Sirius Black.",
    "18": "Truths emerge: Scabbers is revealed as Peter Pettigrew and Lupin is a werewolf. The group pieces together what happened twelve years ago.",
    "19": "Tensions escalate when Lupin transforms into a werewolf under the full moon. Pettigrew escapes and chaos ensues.",
    "20": "Harry and Hermione escape back to Hogwarts pursued by Dementors. Harry casts a Patronus to save them both.",
    "21": "Using the Time-Turner, Harry and Hermione travel back and rescue Buckbeak and Sirius before their executions. Events unfold from a second perspective.",
    "22": "Infirmary return: Lupin resigns, Black is held captive, and Hermione gives Harry a letter from Sirius. The school year ends quietly."
  }
}
