{
  "meta": {
    "title": "The Way of Kings",
    "author": "Brandon Sanderson",
    "chapters": 75,
    "createdAt": "2024-01-01T00:00:00Z",
    "schemaVersion": "1.0"
  },
  "characters": {
    "kaladin": {
      "name": "Kaladin",
      "aliases": ["Kal", "Stormblessed"],
      "tiers": {
        "1": {
          "appearsIn": 1,
          "description": "A young soldier with dark hair serving as squadleader in Brightlord Amaram's army. Known for his protective nature toward his men.",
          "role": "Squadleader",
          "relationships": {
            "Cenn": "Protects"
          }
        },
        "3": {
          "appearsIn": 3,
          "description": "A former soldier now enslaved as a bridgeman. Bears shash brand on forehead marking him as dangerous. Struggles with depression and loss.",
          "role": "Bridgeman (Bridge Four)",
          "relationships": {
            "Cenn": "Failed to protect",
            "Gaz": "Supervised by"
          }
        },
        "11": {
          "appearsIn": 11,
          "description": "Bridgeman who has started to care for Bridge Four despite himself. Shows medical knowledge from his father's training. Natural leader emerging from despair.",
          "role": "Bridge Four Leader",
          "relationships": {
            "Bridge Four": "Leads",
            "Gaz": "Tense relationship with",
            "Syl": "Followed by strange windspren"
          }
        }
      }
    },
    "shallan": {
      "name": "Shallan Davar",
      "aliases": [],
      "tiers": {
        "3": {
          "appearsIn": 3,
          "description": "Young lighteyed woman from rural Jah Keved, traveling to become ward of scholar Jasnah Kholin. Artistic and witty but hides dark secrets.",
          "role": "Prospective Ward"
        },
        "7": {
          "appearsIn": 7,
          "description": "Jasnah's new ward studying in Kharbranth. Talented artist with exceptional memory. Pursuing scholarship while harboring hidden agenda.",
          "role": "Jasnah's Ward",
          "relationships": {
            "Jasnah Kholin": "Ward of",
            "Kabsal": "Befriended by"
          }
        }
      }
    },
    "dalinar": {
      "name": "Dalinar Kholin",
      "aliases": ["The Blackthorn"],
      "tiers": {
        "12": {
          "appearsIn": 12,
          "description": "Highprince of Alethkar and brother to the late King Gavilar. Once feared as the Blackthorn, now follows the Codes and seeks unity. Experiences strange visions during highstorms.",
          "role": "Highprince",
          "relationships": {
            "Gavilar": "Brother (deceased)",
            "Adolin": "Father of",
            "Renarin": "Father of",
            "Navani": "Sister-in-law"
          }
        },
        "18": {
          "appearsIn": 18,
          "description": "Highprince who questions old ways of war. His adherence to the Codes makes other highprinces view him as weak. Visions grow more intense and detailed.",
          "role": "Highprince of War",
          "relationships": {
            "Gavilar": "Brother (deceased)",
            "Adolin": "Father of",
            "Renarin": "Father of", 
            "Navani": "Sister-in-law, growing closer to",
            "Sadeas": "Former friend, now rival"
          }
        }
      }
    },
    "adolin": {
      "name": "Adolin Kholin",
      "aliases": [],
      "tiers": {
        "12": {
          "appearsIn": 12,
          "description": "Dalinar's elder son and accomplished duelist. Fashionable and popular among lighteyes but loyal to his father despite doubts about the visions.",
          "role": "Highprince's Son",
          "relationships": {
            "Dalinar": "Son of",
            "Renarin": "Brother of"
          }
        }
      }
    },
    "szeth": {
      "name": "Szeth-son-son-Vallano",
      "aliases": ["Assassin in White"],
      "tiers": {
        "1": {
          "appearsIn": 1,
          "description": "Shin man dressed in white who possesses strange powers over gravity. Bound by mysterious oaths to obey whoever holds his oathstone.",
          "role": "Truthless of Shinovar",
          "relationships": {
            "Gavilar": "Assassinated"
          }
        }
      }
    },
    "cenn": {
      "name": "Cenn",
      "aliases": [],
      "tiers": {
        "1": {
          "appearsIn": 1,
          "description": "Young, inexperienced spearman in Kaladin's squad. First time in real combat and terrified.",
          "role": "Spearman",
          "relationships": {
            "Kaladin": "Protected by"
          }
        }
      }
    },
    "gaz": {
      "name": "Gaz",
      "aliases": [],
      "tiers": {
        "3": {
          "appearsIn": 3,
          "description": "Bridge crew overseer with one eye. Takes bribes and treats bridgemen as expendable. Seems to have his own pressures and fears.",
          "role": "Bridge Sergeant",
          "relationships": {
            "Kaladin": "Supervises"
          }
        }
      }
    },
    "syl": {
      "name": "Sylphrena",
      "aliases": ["Syl"],
      "tiers": {
        "2": {
          "appearsIn": 2,
          "description": "An unusual windspren that follows Kaladin. More aware and coherent than typical spren, speaking and showing curiosity about humans.",
          "role": "Windspren",
          "relationships": {
            "Kaladin": "Follows"
          }
        },
        "11": {
          "appearsIn": 11,
          "description": "Increasingly self-aware windspren who acts unlike any normal spren. Can change size and appearance. Shows deep concern for Kaladin's wellbeing.",
          "role": "Unique Windspren",
          "relationships": {
            "Kaladin": "Bonded to"
          }
        }
      }
    },
    "jasnah": {
      "name": "Jasnah Kholin",
      "aliases": [],
      "tiers": {
        "3": {
          "appearsIn": 3,
          "description": "Renowned scholar and daughter of the late King Gavilar. Known for her intelligence, atheism, and exacting standards. Researching in Kharbranth.",
          "role": "Scholar & Princess",
          "relationships": {
            "Gavilar": "Daughter of (deceased)",
            "Dalinar": "Niece of",
            "Shallan": "Potential patron of"
          }
        },
        "7": {
          "appearsIn": 7,
          "description": "Brilliant scholar researching ancient history with unusual intensity. Has taken Shallan as ward. Demonstrates mysterious abilities during emergency.",
          "role": "Scholar & Princess", 
          "relationships": {
            "Shallan": "Patron of",
            "Dalinar": "Niece of",
            "Navani": "Daughter of"
          }
        }
      }
    }
  },
  "recaps": {
    "1": "Kaladin leads his squad in battle, trying to protect young Cenn. Meanwhile, Szeth assassinates King Gavilar at a treaty celebration.",
    "2": "Eight months later, Kaladin is now a slave being transported to the Shattered Plains. A strange windspren named Syl begins following him.",
    "3": "Kaladin arrives at the warcamp and is assigned to Bridge Four. Shallan arrives in Kharbranth seeking to become Jasnah's ward.",
    "7": "Shallan becomes Jasnah's ward and begins her studies. She meets the ardent Kabsal who shows interest in her.",
    "11": "Kaladin begins caring for wounded bridgemen and starts earning Bridge Four's respect. Syl becomes more self-aware.",
    "12": "We meet Dalinar and Adolin Kholin on the Shattered Plains. Dalinar experiences a vision during a highstorm.",
    "18": "Dalinar's visions intensify. His relationship with Sadeas deteriorates as political tensions rise in the warcamps.",
    "4": "Rock explains bridge crew hierarchy to Kaladin. The crew faces their first bridge run under enemy fire, experiencing the brutal reality of their role.",
    "5": "Kaladin witnesses the true cost of bridge runs as men die around him. He begins to understand the strategic purpose of the bridges in plateau assaults.",
    "6": "Shallan continues her studies with Jasnah, learning about ancient history. She struggles to find the right moment to accomplish her secret mission.",
    "8": "Shallan attempts to steal Jasnah's soulcaster but the plan goes awry. She experiences strange phenomena during the theft attempt.",
    "9": "Kaladin survives another bridge run and begins to notice patterns in Parshendi behavior. He starts to care despite trying to remain detached.",
    "10": "Shallan's relationship with Jasnah becomes strained after the failed theft. She must find a way to explain her actions without revealing her true purpose.",
    "13": "Dalinar experiences another powerful vision during a highstorm, seeing ancient Knights Radiant. The vision's message troubles him deeply.",
    "14": "Kaladin begins to actively help wounded bridgemen, earning their gratitude. His medical knowledge from his father's training proves valuable.",
    "15": "Shallan receives word from home that increases the urgency of her mission. Her family's situation grows more desperate.",
    "16": "Kaladin's leadership begins to transform Bridge Four as he implements small changes to improve their survival chances.",
    "17": "Adolin participates in dueling competitions while Dalinar wrestles with the meaning of his visions and their implications for Alethkar.",
    "19": "Bridge Four starts working as a team under Kaladin's guidance. Their survival rate improves as they begin to trust each other.",
    "20": "Shallan's studies with Jasnah reveal more about the ancient past and the mysterious creatures called Voidbringers.",
    "21": "Dalinar faces criticism from other highprinces for his adherence to the Codes of War, which they see as weakness in their endless conflict.",
    "22": "Kaladin secures better treatment for Bridge Four through clever negotiation with Gaz. The crew begins to see him as their leader.",
    "23": "Shallan creates detailed drawings of creatures and phenomena she studies, developing her artistic skills while pursuing her research.",
    "24": "A particularly brutal bridge run tests Kaladin's resolve to protect his men. He makes difficult decisions about leadership and sacrifice.",
    "25": "Dalinar's visions show him more of the ancient past, including warnings about a coming storm that extends beyond weather.",
    "26": "Kaladin begins training Bridge Four in basic combat techniques, despite the apparent futility of their situation as bridgemen.",
    "27": "Shallan's relationship with Kabsal develops as he continues to visit her, bringing jam and philosophical discussions.",
    "28": "Sadeas and Dalinar's rivalry becomes more pronounced during joint plateau assaults, affecting military effectiveness.",
    "29": "Kaladin's efforts to improve Bridge Four's equipment and tactics begin to show results in their survival rates.",
    "30": "Shallan discovers more about the nature of spren through her studies, leading to questions about the fundamental nature of her world.",
    "31": "Dalinar considers abandoning the Codes after pressure from family and other highprinces who question his effectiveness as a military leader.",
    "32": "Bridge Four faces a dangerous situation that tests their newfound unity and Kaladin's leadership under extreme pressure.",
    "33": "Shallan's artistic abilities reveal unexpected aspects of the subjects she draws, leading to discoveries about the nature of reality.",
    "34": "Kaladin's past as Tien's brother and his father's apprentice weighs on him as he tries to save lives in an impossible situation.",
    "35": "Adolin grows concerned about his father's visions and their impact on House Kholin's political standing among the highprinces.",
    "36": "Bridge Four's camaraderie strengthens as they face increasing dangers together, developing their own identity and purpose.",
    "37": "Shallan's research into the Voidbringers yields disturbing revelations about ancient history and potential future threats.",
    "38": "Dalinar's visions become more frequent and detailed, showing him glimpses of ancient Knights Radiant and their sacred oaths.",
    "39": "Kaladin faces a moral crisis when he must choose between following orders and protecting his men during a bridge run.",
    "40": "Shallan's secret correspondence with her family reveals the growing desperation of her situation and the stakes of her mission.",
    "41": "The relationship between Kaladin and Syl deepens as she demonstrates increasingly unusual behavior for a spren.",
    "42": "Dalinar makes a significant decision about his future role based on the guidance he receives from his mysterious visions.",
    "43": "Bridge Four faces their most challenging assault yet, testing everything Kaladin has taught them about survival and teamwork.",
    "44": "Shallan's studies with Jasnah reveal connections between historical events and current threats facing the kingdoms.",
    "45": "Kaladin's medical knowledge proves crucial when Bridge Four members suffer severe injuries during a particularly bloody plateau run.",
    "46": "Dalinar's adherence to honor in warfare creates tension with Sadeas during a joint military operation on the Plains.",
    "47": "Shallan encounters unexpected dangers in Kharbranth that threaten both her mission and her safety.",
    "48": "Kaladin discovers that survival isn't enough - Bridge Four needs a greater purpose to truly escape their grim fate.",
    "49": "Adolin struggles with his father's increasing mysticism while trying to maintain House Kholin's reputation and influence.",
    "50": "Shallan's relationship with Jasnah evolves as her mentor begins to trust her with more significant research and responsibilities.",
    "51": "A major plateau assault forces Kaladin to make life-or-death decisions that will define his role as Bridge Four's leader.",
    "52": "Dalinar's visions reveal more about the ancient Radiants and their connection to the mystical forces affecting the world.",
    "53": "Shallan faces a crisis that threatens to expose her true motives to Jasnah and derail her family's desperate plan.",
    "54": "Kaladin begins to understand that his bond with Syl might be the key to transcending the limitations of his current situation.",
    "55": "Political maneuvering in the warcamps intensifies as Dalinar's rivals seek to undermine his influence and authority.",
    "56": "Bridge Four's transformation under Kaladin's leadership attracts attention from unexpected quarters in the warcamp.",
    "57": "Shallan's artistic discoveries lead to revelations about the true nature of the ancient forces that shaped her world.",
    "58": "Dalinar faces a critical test of his principles when honor conflicts with practical military necessity.",
    "59": "Kaladin's growing abilities manifest in ways that suggest his connection to Syl is far more significant than anyone realizes.",
    "60": "Shallan's mission reaches a turning point as circumstances force her to take decisive action regarding her secret objectives.",
    "61": "The rivalry between Dalinar and Sadeas comes to a head during a crucial battle that will determine the future of their alliance.",
    "62": "Bridge Four faces their ultimate test as Kaladin's leadership and their unity are challenged by seemingly impossible odds.",
    "63": "Shallan discovers the truth about her own abilities and their connection to the ancient powers she has been studying.",
    "64": "Dalinar's visions culminate in a revelation that changes his understanding of his role in the larger conflict ahead.",
    "65": "Kaladin manifests abilities that mark him as something more than an ordinary bridgeman, drawing both hope and danger.",
    "66": "Shallan's deception is revealed, forcing her to confront the consequences of her actions and make critical choices.",
    "67": "The various storylines begin to converge as the characters' destinies become intertwined with larger cosmic forces.",
    "68": "Major revelations about the nature of spren, Radiants, and the ancient conflict reshape the characters' understanding of their world.",
    "69": "Kaladin faces the culmination of his journey from slave to leader, with the fate of Bridge Four hanging in the balance.",
    "70": "Shallan's true nature is revealed as she embraces abilities she never knew she possessed, changing her relationship with Jasnah.",
    "71": "Dalinar's arc reaches its climax as he must choose between personal safety and the greater good in a moment of crisis.",
    "72": "The Battle of the Tower begins as all the main characters' storylines converge in a massive conflict on the Shattered Plains.",
    "73": "The battle intensifies as Kaladin's newfound powers are put to the ultimate test in a desperate fight for survival.",
    "74": "Revelations about the true nature of the conflict and the ancient enemies reshape everything the characters thought they knew.",
    "75": "The climactic conclusion brings together all storylines as the characters embrace their destinies and prepare for the greater war ahead."
  }
}
