{
  "meta": {
    "title": "Words of Radiance",
    "author": "Brandon Sanderson",
    "series": "The Stormlight Archive",
    "seriesOrder": 2,
    "chapters": 89,
    "schemaVersion": "2.0",
    "amazonUrl": "https://www.amazon.com/Words-Radiance-Stormlight-Archive-Book/dp/0765326361/?tag=spoilerfree-20"
  },
  "characters": {
    "kaladin": {
      "name": "Kaladin",
      "aliases": [
        "Kaladin Stormblessed",
        "Captain Kaladin",
        "Bridgeboy"
      ],
      "appearances": [
        1,
        2,
        3,
        4,
        7,
        10,
        13,
        16,
        20,
        24,
        27,
        31,
        36,
        40,
        43,
        47,
        51,
        55,
        59,
        61,
        65,
        69,
        70,
        73,
        76,
        77,
        78,
        81,
        84,
        85,
        86,
        87
      ],
      "knowledge": {
        "1": {
          "revealedIn": 1,
          "description": "Now serves as captain of Bridge Four, struggling with his new responsibilities and the weight of command. He trains with the new swordsmaster Zahel and grapples with keeping his men safe.",
          "role": "Captain of Bridge Four",
          "relationships": {
            "Syl": "Bonded to - honorspren",
            "Bridge Four": "Leader of - former bridgemen",
            "Dalinar": "Serves under - Highprince",
            "Zahel": "Trains with - swordsmaster"
          }
        }
      }
    }
  },
  "recaps": {
    "prologue": "Jasnah and Shallan use Soulcasting to escape their attackers, creating a hole in their ship's hull. They find themselves in the Cognitive Realm, a strange place where the ship appears as beads and Jasnah explains they must find their way back to the Physical Realm.",
    "1": "Two months after the end of The Way of Kings, Kaladin struggles with his new role as captain while Bridge Four adjusts to their elevated status. He trains with Zahel, the new swordsmaster, and grapples with the responsibility of his position and his men's safety.",
    "2": "Shallan travels toward the Shattered Plains, drawing and studying while plagued by guilt over her family's past. She practices with Pattern, her spren, learning more about her Soulcasting abilities while trying to suppress painful memories.",
    "3": "Dalinar continues his political maneuvering, working to unite the highprinces while dealing with the aftermath of recent revelations. He meets with various nobles and struggles with the balance between honor and pragmatism in leadership.",
    "4": "Kaladin deals with the challenges of integrating former bridgemen into the military structure while maintaining their loyalty. Moash expresses concerns about their treatment, and tensions arise as Bridge Four adapts to their new circumstances.",
    "5": "Shallan arrives at the Shattered Plains and is overwhelmed by the scope of the warcamps. She observes the culture and politics while trying to locate Jasnah, unaware of what happened to her mentor during their sea voyage.",
    "6": "Adolin prepares for dueling season and deals with political pressures from his father's reforms. He struggles with expectations and his role in Dalinar's plans while maintaining his reputation as a duelist and his relationships with other nobles.",
    "7": "Kaladin trains Bridge Four in more advanced combat techniques while dealing with his own evolving abilities with Syl. The bridgemen struggle with their new roles as soldiers, and Kaladin works to build their confidence and skills.",
    "8": "Shallan seeks information about Jasnah's whereabouts while navigating the complex social dynamics of the warcamps. She begins to realize the scope of the task ahead of her and the challenges she'll face without her mentor's guidance.",
    "9": "Dalinar meets with Navani and discusses the implications of the visions and his growing understanding of the ancient conflict. They work together to decipher historical records and plan for the future while managing their growing relationship.",
    "10": "Kaladin faces challenges with the integration of Bridge Four into the army structure. Tension builds as former bridgemen struggle with military hierarchy and discipline while trying to maintain their brotherhood and identity."
  }
}